bouffalolab/bouffalo_sdk/components/multimedia/xcodec/src/bl606p/drv/msp_audio_reg.h
#if 1
/**
  ******************************************************************************
  * @file    audio_reg.h
  * @version V1.0
  * @date    2021-07-19
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __MSP_AUDIO_REG_H__
#define __MSP_AUDIO_REG_H__

// #include "msp_bl606p.h"
#include "msp_bl606p_platform.h"

/* 0x0 : aud_top */
#define AUDIO_AUD_TOP_OFFSET       (0x0)
#define AUDIO_CKG_EN               AUDIO_CKG_EN
#define AUDIO_CKG_EN_POS           (0U)
#define AUDIO_CKG_EN_LEN           (1U)
#define AUDIO_CKG_EN_MSK           (((1U << AUDIO_CKG_EN_LEN) - 1) << AUDIO_CKG_EN_POS)
#define AUDIO_CKG_EN_UMSK          (~(((1U << AUDIO_CKG_EN_LEN) - 1) << AUDIO_CKG_EN_POS))
#define AUDIO_DAC_ITF_INV_SEL      AUDIO_DAC_ITF_INV_SEL
#define AUDIO_DAC_ITF_INV_SEL_POS  (1U)
#define AUDIO_DAC_ITF_INV_SEL_LEN  (1U)
#define AUDIO_DAC_ITF_INV_SEL_MSK  (((1U << AUDIO_DAC_ITF_INV_SEL_LEN) - 1) << AUDIO_DAC_ITF_INV_SEL_POS)
#define AUDIO_DAC_ITF_INV_SEL_UMSK (~(((1U << AUDIO_DAC_ITF_INV_SEL_LEN) - 1) << AUDIO_DAC_ITF_INV_SEL_POS))
#define AUDIO_ADC_ITF_INV_SEL      AUDIO_ADC_ITF_INV_SEL
#define AUDIO_ADC_ITF_INV_SEL_POS  (2U)
#define AUDIO_ADC_ITF_INV_SEL_LEN  (1U)
#define AUDIO_ADC_ITF_INV_SEL_MSK  (((1U << AUDIO_ADC_ITF_INV_SEL_LEN) - 1) << AUDIO_ADC_ITF_INV_SEL_POS)
#define AUDIO_ADC_ITF_INV_SEL_UMSK (~(((1U << AUDIO_ADC_ITF_INV_SEL_LEN) - 1) << AUDIO_ADC_ITF_INV_SEL_POS))
#define AUDIO_PDM_ITF_INV_SEL      AUDIO_PDM_ITF_INV_SEL
#define AUDIO_PDM_ITF_INV_SEL_POS  (3U)
#define AUDIO_PDM_ITF_INV_SEL_LEN  (1U)
#define AUDIO_PDM_ITF_INV_SEL_MSK  (((1U << AUDIO_PDM_ITF_INV_SEL_LEN) - 1) << AUDIO_PDM_ITF_INV_SEL_POS)
#define AUDIO_PDM_ITF_INV_SEL_UMSK (~(((1U << AUDIO_PDM_ITF_INV_SEL_LEN) - 1) << AUDIO_PDM_ITF_INV_SEL_POS))
#define AUDIO_DAC_RATE             AUDIO_DAC_RATE
#define AUDIO_DAC_RATE_POS         (24U)
#define AUDIO_DAC_RATE_LEN         (3U)
#define AUDIO_DAC_RATE_MSK         (((1U << AUDIO_DAC_RATE_LEN) - 1) << AUDIO_DAC_RATE_POS)
#define AUDIO_DAC_RATE_UMSK        (~(((1U << AUDIO_DAC_RATE_LEN) - 1) << AUDIO_DAC_RATE_POS))
#define AUDIO_ADC_RATE             AUDIO_ADC_RATE
#define AUDIO_ADC_RATE_POS         (28U)
#define AUDIO_ADC_RATE_LEN         (3U)
#define AUDIO_ADC_RATE_MSK         (((1U << AUDIO_ADC_RATE_LEN) - 1) << AUDIO_ADC_RATE_POS)
#define AUDIO_ADC_RATE_UMSK        (~(((1U << AUDIO_ADC_RATE_LEN) - 1) << AUDIO_ADC_RATE_POS))

/* 0x4 : aud_itf */
#define AUDIO_AUD_ITF_OFFSET   (0x4)
#define AUDIO_ADC_0_EN         AUDIO_ADC_0_EN
#define AUDIO_ADC_0_EN_POS     (0U)
#define AUDIO_ADC_0_EN_LEN     (1U)
#define AUDIO_ADC_0_EN_MSK     (((1U << AUDIO_ADC_0_EN_LEN) - 1) << AUDIO_ADC_0_EN_POS)
#define AUDIO_ADC_0_EN_UMSK    (~(((1U << AUDIO_ADC_0_EN_LEN) - 1) << AUDIO_ADC_0_EN_POS))
#define AUDIO_ADC_1_EN         AUDIO_ADC_1_EN
#define AUDIO_ADC_1_EN_POS     (1U)
#define AUDIO_ADC_1_EN_LEN     (1U)
#define AUDIO_ADC_1_EN_MSK     (((1U << AUDIO_ADC_1_EN_LEN) - 1) << AUDIO_ADC_1_EN_POS)
#define AUDIO_ADC_1_EN_UMSK    (~(((1U << AUDIO_ADC_1_EN_LEN) - 1) << AUDIO_ADC_1_EN_POS))
#define AUDIO_ADC_2_EN         AUDIO_ADC_2_EN
#define AUDIO_ADC_2_EN_POS     (2U)
#define AUDIO_ADC_2_EN_LEN     (1U)
#define AUDIO_ADC_2_EN_MSK     (((1U << AUDIO_ADC_2_EN_LEN) - 1) << AUDIO_ADC_2_EN_POS)
#define AUDIO_ADC_2_EN_UMSK    (~(((1U << AUDIO_ADC_2_EN_LEN) - 1) << AUDIO_ADC_2_EN_POS))
#define AUDIO_DAC_0_EN         AUDIO_DAC_0_EN
#define AUDIO_DAC_0_EN_POS     (3U)
#define AUDIO_DAC_0_EN_LEN     (1U)
#define AUDIO_DAC_0_EN_MSK     (((1U << AUDIO_DAC_0_EN_LEN) - 1) << AUDIO_DAC_0_EN_POS)
#define AUDIO_DAC_0_EN_UMSK    (~(((1U << AUDIO_DAC_0_EN_LEN) - 1) << AUDIO_DAC_0_EN_POS))
#define AUDIO_DAC_1_EN         AUDIO_DAC_1_EN
#define AUDIO_DAC_1_EN_POS     (4U)
#define AUDIO_DAC_1_EN_LEN     (1U)
#define AUDIO_DAC_1_EN_MSK     (((1U << AUDIO_DAC_1_EN_LEN) - 1) << AUDIO_DAC_1_EN_POS)
#define AUDIO_DAC_1_EN_UMSK    (~(((1U << AUDIO_DAC_1_EN_LEN) - 1) << AUDIO_DAC_1_EN_POS))
#define AUDIO_AEC_0_EN         AUDIO_AEC_0_EN
#define AUDIO_AEC_0_EN_POS     (5U)
#define AUDIO_AEC_0_EN_LEN     (1U)
#define AUDIO_AEC_0_EN_MSK     (((1U << AUDIO_AEC_0_EN_LEN) - 1) << AUDIO_AEC_0_EN_POS)
#define AUDIO_AEC_0_EN_UMSK    (~(((1U << AUDIO_AEC_0_EN_LEN) - 1) << AUDIO_AEC_0_EN_POS))
#define AUDIO_AEC_1_EN         AUDIO_AEC_1_EN
#define AUDIO_AEC_1_EN_POS     (6U)
#define AUDIO_AEC_1_EN_LEN     (1U)
#define AUDIO_AEC_1_EN_MSK     (((1U << AUDIO_AEC_1_EN_LEN) - 1) << AUDIO_AEC_1_EN_POS)
#define AUDIO_AEC_1_EN_UMSK    (~(((1U << AUDIO_AEC_1_EN_LEN) - 1) << AUDIO_AEC_1_EN_POS))
#define AUDIO_AUD_RX0_SEL      AUDIO_AUD_RX0_SEL
#define AUDIO_AUD_RX0_SEL_POS  (13U)
#define AUDIO_AUD_RX0_SEL_LEN  (3U)
#define AUDIO_AUD_RX0_SEL_MSK  (((1U << AUDIO_AUD_RX0_SEL_LEN) - 1) << AUDIO_AUD_RX0_SEL_POS)
#define AUDIO_AUD_RX0_SEL_UMSK (~(((1U << AUDIO_AUD_RX0_SEL_LEN) - 1) << AUDIO_AUD_RX0_SEL_POS))
#define AUDIO_AUD_RX1_SEL      AUDIO_AUD_RX1_SEL
#define AUDIO_AUD_RX1_SEL_POS  (16U)
#define AUDIO_AUD_RX1_SEL_LEN  (3U)
#define AUDIO_AUD_RX1_SEL_MSK  (((1U << AUDIO_AUD_RX1_SEL_LEN) - 1) << AUDIO_AUD_RX1_SEL_POS)
#define AUDIO_AUD_RX1_SEL_UMSK (~(((1U << AUDIO_AUD_RX1_SEL_LEN) - 1) << AUDIO_AUD_RX1_SEL_POS))
#define AUDIO_AUD_RX2_SEL      AUDIO_AUD_RX2_SEL
#define AUDIO_AUD_RX2_SEL_POS  (19U)
#define AUDIO_AUD_RX2_SEL_LEN  (3U)
#define AUDIO_AUD_RX2_SEL_MSK  (((1U << AUDIO_AUD_RX2_SEL_LEN) - 1) << AUDIO_AUD_RX2_SEL_POS)
#define AUDIO_AUD_RX2_SEL_UMSK (~(((1U << AUDIO_AUD_RX2_SEL_LEN) - 1) << AUDIO_AUD_RX2_SEL_POS))
#define AUDIO_AUD_RX3_SEL      AUDIO_AUD_RX3_SEL
#define AUDIO_AUD_RX3_SEL_POS  (22U)
#define AUDIO_AUD_RX3_SEL_LEN  (3U)
#define AUDIO_AUD_RX3_SEL_MSK  (((1U << AUDIO_AUD_RX3_SEL_LEN) - 1) << AUDIO_AUD_RX3_SEL_POS)
#define AUDIO_AUD_RX3_SEL_UMSK (~(((1U << AUDIO_AUD_RX3_SEL_LEN) - 1) << AUDIO_AUD_RX3_SEL_POS))
#define AUDIO_AUD_RX4_SEL      AUDIO_AUD_RX4_SEL
#define AUDIO_AUD_RX4_SEL_POS  (25U)
#define AUDIO_AUD_RX4_SEL_LEN  (3U)
#define AUDIO_AUD_RX4_SEL_MSK  (((1U << AUDIO_AUD_RX4_SEL_LEN) - 1) << AUDIO_AUD_RX4_SEL_POS)
#define AUDIO_AUD_RX4_SEL_UMSK (~(((1U << AUDIO_AUD_RX4_SEL_LEN) - 1) << AUDIO_AUD_RX4_SEL_POS))
#define AUDIO_AUD_TX0_SEL      AUDIO_AUD_TX0_SEL
#define AUDIO_AUD_TX0_SEL_POS  (28U)
#define AUDIO_AUD_TX0_SEL_LEN  (1U)
#define AUDIO_AUD_TX0_SEL_MSK  (((1U << AUDIO_AUD_TX0_SEL_LEN) - 1) << AUDIO_AUD_TX0_SEL_POS)
#define AUDIO_AUD_TX0_SEL_UMSK (~(((1U << AUDIO_AUD_TX0_SEL_LEN) - 1) << AUDIO_AUD_TX0_SEL_POS))
#define AUDIO_AUD_TX1_SEL      AUDIO_AUD_TX1_SEL
#define AUDIO_AUD_TX1_SEL_POS  (29U)
#define AUDIO_AUD_TX1_SEL_LEN  (1U)
#define AUDIO_AUD_TX1_SEL_MSK  (((1U << AUDIO_AUD_TX1_SEL_LEN) - 1) << AUDIO_AUD_TX1_SEL_POS)
#define AUDIO_AUD_TX1_SEL_UMSK (~(((1U << AUDIO_AUD_TX1_SEL_LEN) - 1) << AUDIO_AUD_TX1_SEL_POS))
#define AUDIO_ADC_ITF_EN       AUDIO_ADC_ITF_EN
#define AUDIO_ADC_ITF_EN_POS   (30U)
#define AUDIO_ADC_ITF_EN_LEN   (1U)
#define AUDIO_ADC_ITF_EN_MSK   (((1U << AUDIO_ADC_ITF_EN_LEN) - 1) << AUDIO_ADC_ITF_EN_POS)
#define AUDIO_ADC_ITF_EN_UMSK  (~(((1U << AUDIO_ADC_ITF_EN_LEN) - 1) << AUDIO_ADC_ITF_EN_POS))
#define AUDIO_DAC_ITF_EN       AUDIO_DAC_ITF_EN
#define AUDIO_DAC_ITF_EN_POS   (31U)
#define AUDIO_DAC_ITF_EN_LEN   (1U)
#define AUDIO_DAC_ITF_EN_MSK   (((1U << AUDIO_DAC_ITF_EN_LEN) - 1) << AUDIO_DAC_ITF_EN_POS)
#define AUDIO_DAC_ITF_EN_UMSK  (~(((1U << AUDIO_DAC_ITF_EN_LEN) - 1) << AUDIO_DAC_ITF_EN_POS))

/* 0x8 : adc_0 */
#define AUDIO_ADC_0_OFFSET         (0x8)
#define AUDIO_ADC_0_FIR_MODE       AUDIO_ADC_0_FIR_MODE
#define AUDIO_ADC_0_FIR_MODE_POS   (0U)
#define AUDIO_ADC_0_FIR_MODE_LEN   (1U)
#define AUDIO_ADC_0_FIR_MODE_MSK   (((1U << AUDIO_ADC_0_FIR_MODE_LEN) - 1) << AUDIO_ADC_0_FIR_MODE_POS)
#define AUDIO_ADC_0_FIR_MODE_UMSK  (~(((1U << AUDIO_ADC_0_FIR_MODE_LEN) - 1) << AUDIO_ADC_0_FIR_MODE_POS))
#define AUDIO_ADC_1_FIR_MODE       AUDIO_ADC_1_FIR_MODE
#define AUDIO_ADC_1_FIR_MODE_POS   (1U)
#define AUDIO_ADC_1_FIR_MODE_LEN   (1U)
#define AUDIO_ADC_1_FIR_MODE_MSK   (((1U << AUDIO_ADC_1_FIR_MODE_LEN) - 1) << AUDIO_ADC_1_FIR_MODE_POS)
#define AUDIO_ADC_1_FIR_MODE_UMSK  (~(((1U << AUDIO_ADC_1_FIR_MODE_LEN) - 1) << AUDIO_ADC_1_FIR_MODE_POS))
#define AUDIO_ADC_2_FIR_MODE       AUDIO_ADC_2_FIR_MODE
#define AUDIO_ADC_2_FIR_MODE_POS   (2U)
#define AUDIO_ADC_2_FIR_MODE_LEN   (1U)
#define AUDIO_ADC_2_FIR_MODE_MSK   (((1U << AUDIO_ADC_2_FIR_MODE_LEN) - 1) << AUDIO_ADC_2_FIR_MODE_POS)
#define AUDIO_ADC_2_FIR_MODE_UMSK  (~(((1U << AUDIO_ADC_2_FIR_MODE_LEN) - 1) << AUDIO_ADC_2_FIR_MODE_POS))
#define AUDIO_ADC_0_SCAL           AUDIO_ADC_0_SCAL
#define AUDIO_ADC_0_SCAL_POS       (3U)
#define AUDIO_ADC_0_SCAL_LEN       (6U)
#define AUDIO_ADC_0_SCAL_MSK       (((1U << AUDIO_ADC_0_SCAL_LEN) - 1) << AUDIO_ADC_0_SCAL_POS)
#define AUDIO_ADC_0_SCAL_UMSK      (~(((1U << AUDIO_ADC_0_SCAL_LEN) - 1) << AUDIO_ADC_0_SCAL_POS))
#define AUDIO_ADC_1_SCAL           AUDIO_ADC_1_SCAL
#define AUDIO_ADC_1_SCAL_POS       (9U)
#define AUDIO_ADC_1_SCAL_LEN       (6U)
#define AUDIO_ADC_1_SCAL_MSK       (((1U << AUDIO_ADC_1_SCAL_LEN) - 1) << AUDIO_ADC_1_SCAL_POS)
#define AUDIO_ADC_1_SCAL_UMSK      (~(((1U << AUDIO_ADC_1_SCAL_LEN) - 1) << AUDIO_ADC_1_SCAL_POS))
#define AUDIO_ADC_2_SCAL           AUDIO_ADC_2_SCAL
#define AUDIO_ADC_2_SCAL_POS       (15U)
#define AUDIO_ADC_2_SCAL_LEN       (6U)
#define AUDIO_ADC_2_SCAL_MSK       (((1U << AUDIO_ADC_2_SCAL_LEN) - 1) << AUDIO_ADC_2_SCAL_POS)
#define AUDIO_ADC_2_SCAL_UMSK      (~(((1U << AUDIO_ADC_2_SCAL_LEN) - 1) << AUDIO_ADC_2_SCAL_POS))
#define AUDIO_ADC_DITHER_DATA      AUDIO_ADC_DITHER_DATA
#define AUDIO_ADC_DITHER_DATA_POS  (29U)
#define AUDIO_ADC_DITHER_DATA_LEN  (1U)
#define AUDIO_ADC_DITHER_DATA_MSK  (((1U << AUDIO_ADC_DITHER_DATA_LEN) - 1) << AUDIO_ADC_DITHER_DATA_POS)
#define AUDIO_ADC_DITHER_DATA_UMSK (~(((1U << AUDIO_ADC_DITHER_DATA_LEN) - 1) << AUDIO_ADC_DITHER_DATA_POS))
#define AUDIO_ADC_LFSR_MODE        AUDIO_ADC_LFSR_MODE
#define AUDIO_ADC_LFSR_MODE_POS    (30U)
#define AUDIO_ADC_LFSR_MODE_LEN    (2U)
#define AUDIO_ADC_LFSR_MODE_MSK    (((1U << AUDIO_ADC_LFSR_MODE_LEN) - 1) << AUDIO_ADC_LFSR_MODE_POS)
#define AUDIO_ADC_LFSR_MODE_UMSK   (~(((1U << AUDIO_ADC_LFSR_MODE_LEN) - 1) << AUDIO_ADC_LFSR_MODE_POS))

/* 0xC : adc_1 */
#define AUDIO_ADC_1_OFFSET     (0xC)
#define AUDIO_ADC_0_K1         AUDIO_ADC_0_K1
#define AUDIO_ADC_0_K1_POS     (0U)
#define AUDIO_ADC_0_K1_LEN     (4U)
#define AUDIO_ADC_0_K1_MSK     (((1U << AUDIO_ADC_0_K1_LEN) - 1) << AUDIO_ADC_0_K1_POS)
#define AUDIO_ADC_0_K1_UMSK    (~(((1U << AUDIO_ADC_0_K1_LEN) - 1) << AUDIO_ADC_0_K1_POS))
#define AUDIO_ADC_0_K1_EN      AUDIO_ADC_0_K1_EN
#define AUDIO_ADC_0_K1_EN_POS  (4U)
#define AUDIO_ADC_0_K1_EN_LEN  (1U)
#define AUDIO_ADC_0_K1_EN_MSK  (((1U << AUDIO_ADC_0_K1_EN_LEN) - 1) << AUDIO_ADC_0_K1_EN_POS)
#define AUDIO_ADC_0_K1_EN_UMSK (~(((1U << AUDIO_ADC_0_K1_EN_LEN) - 1) << AUDIO_ADC_0_K1_EN_POS))
#define AUDIO_ADC_0_K2         AUDIO_ADC_0_K2
#define AUDIO_ADC_0_K2_POS     (5U)
#define AUDIO_ADC_0_K2_LEN     (4U)
#define AUDIO_ADC_0_K2_MSK     (((1U << AUDIO_ADC_0_K2_LEN) - 1) << AUDIO_ADC_0_K2_POS)
#define AUDIO_ADC_0_K2_UMSK    (~(((1U << AUDIO_ADC_0_K2_LEN) - 1) << AUDIO_ADC_0_K2_POS))
#define AUDIO_ADC_0_K2_EN      AUDIO_ADC_0_K2_EN
#define AUDIO_ADC_0_K2_EN_POS  (9U)
#define AUDIO_ADC_0_K2_EN_LEN  (1U)
#define AUDIO_ADC_0_K2_EN_MSK  (((1U << AUDIO_ADC_0_K2_EN_LEN) - 1) << AUDIO_ADC_0_K2_EN_POS)
#define AUDIO_ADC_0_K2_EN_UMSK (~(((1U << AUDIO_ADC_0_K2_EN_LEN) - 1) << AUDIO_ADC_0_K2_EN_POS))
#define AUDIO_ADC_1_K1         AUDIO_ADC_1_K1
#define AUDIO_ADC_1_K1_POS     (10U)
#define AUDIO_ADC_1_K1_LEN     (4U)
#define AUDIO_ADC_1_K1_MSK     (((1U << AUDIO_ADC_1_K1_LEN) - 1) << AUDIO_ADC_1_K1_POS)
#define AUDIO_ADC_1_K1_UMSK    (~(((1U << AUDIO_ADC_1_K1_LEN) - 1) << AUDIO_ADC_1_K1_POS))
#define AUDIO_ADC_1_K1_EN      AUDIO_ADC_1_K1_EN
#define AUDIO_ADC_1_K1_EN_POS  (14U)
#define AUDIO_ADC_1_K1_EN_LEN  (1U)
#define AUDIO_ADC_1_K1_EN_MSK  (((1U << AUDIO_ADC_1_K1_EN_LEN) - 1) << AUDIO_ADC_1_K1_EN_POS)
#define AUDIO_ADC_1_K1_EN_UMSK (~(((1U << AUDIO_ADC_1_K1_EN_LEN) - 1) << AUDIO_ADC_1_K1_EN_POS))
#define AUDIO_ADC_1_K2         AUDIO_ADC_1_K2
#define AUDIO_ADC_1_K2_POS     (15U)
#define AUDIO_ADC_1_K2_LEN     (4U)
#define AUDIO_ADC_1_K2_MSK     (((1U << AUDIO_ADC_1_K2_LEN) - 1) << AUDIO_ADC_1_K2_POS)
#define AUDIO_ADC_1_K2_UMSK    (~(((1U << AUDIO_ADC_1_K2_LEN) - 1) << AUDIO_ADC_1_K2_POS))
#define AUDIO_ADC_1_K2_EN      AUDIO_ADC_1_K2_EN
#define AUDIO_ADC_1_K2_EN_POS  (19U)
#define AUDIO_ADC_1_K2_EN_LEN  (1U)
#define AUDIO_ADC_1_K2_EN_MSK  (((1U << AUDIO_ADC_1_K2_EN_LEN) - 1) << AUDIO_ADC_1_K2_EN_POS)
#define AUDIO_ADC_1_K2_EN_UMSK (~(((1U << AUDIO_ADC_1_K2_EN_LEN) - 1) << AUDIO_ADC_1_K2_EN_POS))
#define AUDIO_ADC_2_K1         AUDIO_ADC_2_K1
#define AUDIO_ADC_2_K1_POS     (20U)
#define AUDIO_ADC_2_K1_LEN     (4U)
#define AUDIO_ADC_2_K1_MSK     (((1U << AUDIO_ADC_2_K1_LEN) - 1) << AUDIO_ADC_2_K1_POS)
#define AUDIO_ADC_2_K1_UMSK    (~(((1U << AUDIO_ADC_2_K1_LEN) - 1) << AUDIO_ADC_2_K1_POS))
#define AUDIO_ADC_2_K1_EN      AUDIO_ADC_2_K1_EN
#define AUDIO_ADC_2_K1_EN_POS  (24U)
#define AUDIO_ADC_2_K1_EN_LEN  (1U)
#define AUDIO_ADC_2_K1_EN_MSK  (((1U << AUDIO_ADC_2_K1_EN_LEN) - 1) << AUDIO_ADC_2_K1_EN_POS)
#define AUDIO_ADC_2_K1_EN_UMSK (~(((1U << AUDIO_ADC_2_K1_EN_LEN) - 1) << AUDIO_ADC_2_K1_EN_POS))
#define AUDIO_ADC_2_K2         AUDIO_ADC_2_K2
#define AUDIO_ADC_2_K2_POS     (25U)
#define AUDIO_ADC_2_K2_LEN     (4U)
#define AUDIO_ADC_2_K2_MSK     (((1U << AUDIO_ADC_2_K2_LEN) - 1) << AUDIO_ADC_2_K2_POS)
#define AUDIO_ADC_2_K2_UMSK    (~(((1U << AUDIO_ADC_2_K2_LEN) - 1) << AUDIO_ADC_2_K2_POS))
#define AUDIO_ADC_2_K2_EN      AUDIO_ADC_2_K2_EN
#define AUDIO_ADC_2_K2_EN_POS  (29U)
#define AUDIO_ADC_2_K2_EN_LEN  (1U)
#define AUDIO_ADC_2_K2_EN_MSK  (((1U << AUDIO_ADC_2_K2_EN_LEN) - 1) << AUDIO_ADC_2_K2_EN_POS)
#define AUDIO_ADC_2_K2_EN_UMSK (~(((1U << AUDIO_ADC_2_K2_EN_LEN) - 1) << AUDIO_ADC_2_K2_EN_POS))

