bouffalolab/bouffalo_sdk/components/multimedia/xcodec/src/bl606p/drv/msp_audio_reg.h
/* 0x278 : peq_06_b0 */
#define AUDIO_PEQ_06_B0_OFFSET (0x278)
#define AUDIO_PEQ_06_B0        AUDIO_PEQ_06_B0
#define AUDIO_PEQ_06_B0_POS    (0U)
#define AUDIO_PEQ_06_B0_LEN    (20U)
#define AUDIO_PEQ_06_B0_MSK    (((1U << AUDIO_PEQ_06_B0_LEN) - 1) << AUDIO_PEQ_06_B0_POS)
#define AUDIO_PEQ_06_B0_UMSK   (~(((1U << AUDIO_PEQ_06_B0_LEN) - 1) << AUDIO_PEQ_06_B0_POS))
#define AUDIO_PEQ_06_BYP       AUDIO_PEQ_06_BYP
#define AUDIO_PEQ_06_BYP_POS   (20U)
#define AUDIO_PEQ_06_BYP_LEN   (1U)
#define AUDIO_PEQ_06_BYP_MSK   (((1U << AUDIO_PEQ_06_BYP_LEN) - 1) << AUDIO_PEQ_06_BYP_POS)
#define AUDIO_PEQ_06_BYP_UMSK  (~(((1U << AUDIO_PEQ_06_BYP_LEN) - 1) << AUDIO_PEQ_06_BYP_POS))
#define AUDIO_PEQ_06_QFMT      AUDIO_PEQ_06_QFMT
#define AUDIO_PEQ_06_QFMT_POS  (21U)
#define AUDIO_PEQ_06_QFMT_LEN  (1U)
#define AUDIO_PEQ_06_QFMT_MSK  (((1U << AUDIO_PEQ_06_QFMT_LEN) - 1) << AUDIO_PEQ_06_QFMT_POS)
#define AUDIO_PEQ_06_QFMT_UMSK (~(((1U << AUDIO_PEQ_06_QFMT_LEN) - 1) << AUDIO_PEQ_06_QFMT_POS))

/* 0x27C : peq_06_b1 */
#define AUDIO_PEQ_06_B1_OFFSET (0x27C)
#define AUDIO_PEQ_06_B1        AUDIO_PEQ_06_B1
#define AUDIO_PEQ_06_B1_POS    (0U)
#define AUDIO_PEQ_06_B1_LEN    (20U)
#define AUDIO_PEQ_06_B1_MSK    (((1U << AUDIO_PEQ_06_B1_LEN) - 1) << AUDIO_PEQ_06_B1_POS)
#define AUDIO_PEQ_06_B1_UMSK   (~(((1U << AUDIO_PEQ_06_B1_LEN) - 1) << AUDIO_PEQ_06_B1_POS))

/* 0x280 : peq_06_b2 */
#define AUDIO_PEQ_06_B2_OFFSET (0x280)
#define AUDIO_PEQ_06_B2        AUDIO_PEQ_06_B2
#define AUDIO_PEQ_06_B2_POS    (0U)
#define AUDIO_PEQ_06_B2_LEN    (20U)
#define AUDIO_PEQ_06_B2_MSK    (((1U << AUDIO_PEQ_06_B2_LEN) - 1) << AUDIO_PEQ_06_B2_POS)
#define AUDIO_PEQ_06_B2_UMSK   (~(((1U << AUDIO_PEQ_06_B2_LEN) - 1) << AUDIO_PEQ_06_B2_POS))

/* 0x284 : peq_06_a1 */
#define AUDIO_PEQ_06_A1_OFFSET (0x284)
#define AUDIO_PEQ_06_A1        AUDIO_PEQ_06_A1
#define AUDIO_PEQ_06_A1_POS    (0U)
#define AUDIO_PEQ_06_A1_LEN    (20U)
#define AUDIO_PEQ_06_A1_MSK    (((1U << AUDIO_PEQ_06_A1_LEN) - 1) << AUDIO_PEQ_06_A1_POS)
#define AUDIO_PEQ_06_A1_UMSK   (~(((1U << AUDIO_PEQ_06_A1_LEN) - 1) << AUDIO_PEQ_06_A1_POS))

/* 0x288 : peq_06_a2 */
#define AUDIO_PEQ_06_A2_OFFSET (0x288)
#define AUDIO_PEQ_06_A2        AUDIO_PEQ_06_A2
#define AUDIO_PEQ_06_A2_POS    (0U)
#define AUDIO_PEQ_06_A2_LEN    (20U)
#define AUDIO_PEQ_06_A2_MSK    (((1U << AUDIO_PEQ_06_A2_LEN) - 1) << AUDIO_PEQ_06_A2_POS)
#define AUDIO_PEQ_06_A2_UMSK   (~(((1U << AUDIO_PEQ_06_A2_LEN) - 1) << AUDIO_PEQ_06_A2_POS))

/* 0x28C : peq_07_b0 */
#define AUDIO_PEQ_07_B0_OFFSET (0x28C)
#define AUDIO_PEQ_07_B0        AUDIO_PEQ_07_B0
#define AUDIO_PEQ_07_B0_POS    (0U)
#define AUDIO_PEQ_07_B0_LEN    (20U)
#define AUDIO_PEQ_07_B0_MSK    (((1U << AUDIO_PEQ_07_B0_LEN) - 1) << AUDIO_PEQ_07_B0_POS)
#define AUDIO_PEQ_07_B0_UMSK   (~(((1U << AUDIO_PEQ_07_B0_LEN) - 1) << AUDIO_PEQ_07_B0_POS))
#define AUDIO_PEQ_07_BYP       AUDIO_PEQ_07_BYP
#define AUDIO_PEQ_07_BYP_POS   (20U)
#define AUDIO_PEQ_07_BYP_LEN   (1U)
#define AUDIO_PEQ_07_BYP_MSK   (((1U << AUDIO_PEQ_07_BYP_LEN) - 1) << AUDIO_PEQ_07_BYP_POS)
#define AUDIO_PEQ_07_BYP_UMSK  (~(((1U << AUDIO_PEQ_07_BYP_LEN) - 1) << AUDIO_PEQ_07_BYP_POS))
#define AUDIO_PEQ_07_QFMT      AUDIO_PEQ_07_QFMT
#define AUDIO_PEQ_07_QFMT_POS  (21U)
#define AUDIO_PEQ_07_QFMT_LEN  (1U)
#define AUDIO_PEQ_07_QFMT_MSK  (((1U << AUDIO_PEQ_07_QFMT_LEN) - 1) << AUDIO_PEQ_07_QFMT_POS)
#define AUDIO_PEQ_07_QFMT_UMSK (~(((1U << AUDIO_PEQ_07_QFMT_LEN) - 1) << AUDIO_PEQ_07_QFMT_POS))

/* 0x290 : peq_07_b1 */
#define AUDIO_PEQ_07_B1_OFFSET (0x290)
#define AUDIO_PEQ_07_B1        AUDIO_PEQ_07_B1
#define AUDIO_PEQ_07_B1_POS    (0U)
#define AUDIO_PEQ_07_B1_LEN    (20U)
#define AUDIO_PEQ_07_B1_MSK    (((1U << AUDIO_PEQ_07_B1_LEN) - 1) << AUDIO_PEQ_07_B1_POS)
#define AUDIO_PEQ_07_B1_UMSK   (~(((1U << AUDIO_PEQ_07_B1_LEN) - 1) << AUDIO_PEQ_07_B1_POS))

/* 0x294 : peq_07_b2 */
#define AUDIO_PEQ_07_B2_OFFSET (0x294)
#define AUDIO_PEQ_07_B2        AUDIO_PEQ_07_B2
#define AUDIO_PEQ_07_B2_POS    (0U)
#define AUDIO_PEQ_07_B2_LEN    (20U)
#define AUDIO_PEQ_07_B2_MSK    (((1U << AUDIO_PEQ_07_B2_LEN) - 1) << AUDIO_PEQ_07_B2_POS)
#define AUDIO_PEQ_07_B2_UMSK   (~(((1U << AUDIO_PEQ_07_B2_LEN) - 1) << AUDIO_PEQ_07_B2_POS))

/* 0x298 : peq_07_a1 */
#define AUDIO_PEQ_07_A1_OFFSET (0x298)
#define AUDIO_PEQ_07_A1        AUDIO_PEQ_07_A1
#define AUDIO_PEQ_07_A1_POS    (0U)
#define AUDIO_PEQ_07_A1_LEN    (20U)
#define AUDIO_PEQ_07_A1_MSK    (((1U << AUDIO_PEQ_07_A1_LEN) - 1) << AUDIO_PEQ_07_A1_POS)
#define AUDIO_PEQ_07_A1_UMSK   (~(((1U << AUDIO_PEQ_07_A1_LEN) - 1) << AUDIO_PEQ_07_A1_POS))

/* 0x29C : peq_07_a2 */
#define AUDIO_PEQ_07_A2_OFFSET (0x29C)
#define AUDIO_PEQ_07_A2        AUDIO_PEQ_07_A2
#define AUDIO_PEQ_07_A2_POS    (0U)
#define AUDIO_PEQ_07_A2_LEN    (20U)
#define AUDIO_PEQ_07_A2_MSK    (((1U << AUDIO_PEQ_07_A2_LEN) - 1) << AUDIO_PEQ_07_A2_POS)
#define AUDIO_PEQ_07_A2_UMSK   (~(((1U << AUDIO_PEQ_07_A2_LEN) - 1) << AUDIO_PEQ_07_A2_POS))

/* 0x2A0 : peq_08_b0 */
#define AUDIO_PEQ_08_B0_OFFSET (0x2A0)
#define AUDIO_PEQ_08_B0        AUDIO_PEQ_08_B0
#define AUDIO_PEQ_08_B0_POS    (0U)
#define AUDIO_PEQ_08_B0_LEN    (20U)
#define AUDIO_PEQ_08_B0_MSK    (((1U << AUDIO_PEQ_08_B0_LEN) - 1) << AUDIO_PEQ_08_B0_POS)
#define AUDIO_PEQ_08_B0_UMSK   (~(((1U << AUDIO_PEQ_08_B0_LEN) - 1) << AUDIO_PEQ_08_B0_POS))
#define AUDIO_PEQ_08_BYP       AUDIO_PEQ_08_BYP
#define AUDIO_PEQ_08_BYP_POS   (20U)
#define AUDIO_PEQ_08_BYP_LEN   (1U)
#define AUDIO_PEQ_08_BYP_MSK   (((1U << AUDIO_PEQ_08_BYP_LEN) - 1) << AUDIO_PEQ_08_BYP_POS)
#define AUDIO_PEQ_08_BYP_UMSK  (~(((1U << AUDIO_PEQ_08_BYP_LEN) - 1) << AUDIO_PEQ_08_BYP_POS))
#define AUDIO_PEQ_08_QFMT      AUDIO_PEQ_08_QFMT
#define AUDIO_PEQ_08_QFMT_POS  (21U)
#define AUDIO_PEQ_08_QFMT_LEN  (1U)
#define AUDIO_PEQ_08_QFMT_MSK  (((1U << AUDIO_PEQ_08_QFMT_LEN) - 1) << AUDIO_PEQ_08_QFMT_POS)
#define AUDIO_PEQ_08_QFMT_UMSK (~(((1U << AUDIO_PEQ_08_QFMT_LEN) - 1) << AUDIO_PEQ_08_QFMT_POS))

/* 0x2A4 : peq_08_b1 */
#define AUDIO_PEQ_08_B1_OFFSET (0x2A4)
#define AUDIO_PEQ_08_B1        AUDIO_PEQ_08_B1
#define AUDIO_PEQ_08_B1_POS    (0U)
#define AUDIO_PEQ_08_B1_LEN    (20U)
#define AUDIO_PEQ_08_B1_MSK    (((1U << AUDIO_PEQ_08_B1_LEN) - 1) << AUDIO_PEQ_08_B1_POS)
#define AUDIO_PEQ_08_B1_UMSK   (~(((1U << AUDIO_PEQ_08_B1_LEN) - 1) << AUDIO_PEQ_08_B1_POS))

/* 0x2A8 : peq_08_b2 */
#define AUDIO_PEQ_08_B2_OFFSET (0x2A8)
#define AUDIO_PEQ_08_B2        AUDIO_PEQ_08_B2
#define AUDIO_PEQ_08_B2_POS    (0U)
#define AUDIO_PEQ_08_B2_LEN    (20U)
#define AUDIO_PEQ_08_B2_MSK    (((1U << AUDIO_PEQ_08_B2_LEN) - 1) << AUDIO_PEQ_08_B2_POS)
#define AUDIO_PEQ_08_B2_UMSK   (~(((1U << AUDIO_PEQ_08_B2_LEN) - 1) << AUDIO_PEQ_08_B2_POS))

/* 0x2AC : peq_08_a1 */
#define AUDIO_PEQ_08_A1_OFFSET (0x2AC)
#define AUDIO_PEQ_08_A1        AUDIO_PEQ_08_A1
#define AUDIO_PEQ_08_A1_POS    (0U)
#define AUDIO_PEQ_08_A1_LEN    (20U)
#define AUDIO_PEQ_08_A1_MSK    (((1U << AUDIO_PEQ_08_A1_LEN) - 1) << AUDIO_PEQ_08_A1_POS)
#define AUDIO_PEQ_08_A1_UMSK   (~(((1U << AUDIO_PEQ_08_A1_LEN) - 1) << AUDIO_PEQ_08_A1_POS))

/* 0x2B0 : peq_08_a2 */
#define AUDIO_PEQ_08_A2_OFFSET (0x2B0)
#define AUDIO_PEQ_08_A2        AUDIO_PEQ_08_A2
#define AUDIO_PEQ_08_A2_POS    (0U)
#define AUDIO_PEQ_08_A2_LEN    (20U)
#define AUDIO_PEQ_08_A2_MSK    (((1U << AUDIO_PEQ_08_A2_LEN) - 1) << AUDIO_PEQ_08_A2_POS)
#define AUDIO_PEQ_08_A2_UMSK   (~(((1U << AUDIO_PEQ_08_A2_LEN) - 1) << AUDIO_PEQ_08_A2_POS))

/* 0x2B4 : peq_09_b0 */
#define AUDIO_PEQ_09_B0_OFFSET (0x2B4)
#define AUDIO_PEQ_09_B0        AUDIO_PEQ_09_B0
#define AUDIO_PEQ_09_B0_POS    (0U)
#define AUDIO_PEQ_09_B0_LEN    (20U)
#define AUDIO_PEQ_09_B0_MSK    (((1U << AUDIO_PEQ_09_B0_LEN) - 1) << AUDIO_PEQ_09_B0_POS)
#define AUDIO_PEQ_09_B0_UMSK   (~(((1U << AUDIO_PEQ_09_B0_LEN) - 1) << AUDIO_PEQ_09_B0_POS))
#define AUDIO_PEQ_09_BYP       AUDIO_PEQ_09_BYP
#define AUDIO_PEQ_09_BYP_POS   (20U)
#define AUDIO_PEQ_09_BYP_LEN   (1U)
#define AUDIO_PEQ_09_BYP_MSK   (((1U << AUDIO_PEQ_09_BYP_LEN) - 1) << AUDIO_PEQ_09_BYP_POS)
#define AUDIO_PEQ_09_BYP_UMSK  (~(((1U << AUDIO_PEQ_09_BYP_LEN) - 1) << AUDIO_PEQ_09_BYP_POS))
#define AUDIO_PEQ_09_QFMT      AUDIO_PEQ_09_QFMT
#define AUDIO_PEQ_09_QFMT_POS  (21U)
#define AUDIO_PEQ_09_QFMT_LEN  (1U)
#define AUDIO_PEQ_09_QFMT_MSK  (((1U << AUDIO_PEQ_09_QFMT_LEN) - 1) << AUDIO_PEQ_09_QFMT_POS)
#define AUDIO_PEQ_09_QFMT_UMSK (~(((1U << AUDIO_PEQ_09_QFMT_LEN) - 1) << AUDIO_PEQ_09_QFMT_POS))

/* 0x2B8 : peq_09_b1 */
#define AUDIO_PEQ_09_B1_OFFSET (0x2B8)
#define AUDIO_PEQ_09_B1        AUDIO_PEQ_09_B1
#define AUDIO_PEQ_09_B1_POS    (0U)
#define AUDIO_PEQ_09_B1_LEN    (20U)
#define AUDIO_PEQ_09_B1_MSK    (((1U << AUDIO_PEQ_09_B1_LEN) - 1) << AUDIO_PEQ_09_B1_POS)
#define AUDIO_PEQ_09_B1_UMSK   (~(((1U << AUDIO_PEQ_09_B1_LEN) - 1) << AUDIO_PEQ_09_B1_POS))

/* 0x2BC : peq_09_b2 */
#define AUDIO_PEQ_09_B2_OFFSET (0x2BC)
#define AUDIO_PEQ_09_B2        AUDIO_PEQ_09_B2
#define AUDIO_PEQ_09_B2_POS    (0U)
#define AUDIO_PEQ_09_B2_LEN    (20U)
#define AUDIO_PEQ_09_B2_MSK    (((1U << AUDIO_PEQ_09_B2_LEN) - 1) << AUDIO_PEQ_09_B2_POS)
#define AUDIO_PEQ_09_B2_UMSK   (~(((1U << AUDIO_PEQ_09_B2_LEN) - 1) << AUDIO_PEQ_09_B2_POS))

/* 0x2C0 : peq_09_a1 */
#define AUDIO_PEQ_09_A1_OFFSET (0x2C0)
#define AUDIO_PEQ_09_A1        AUDIO_PEQ_09_A1
#define AUDIO_PEQ_09_A1_POS    (0U)
#define AUDIO_PEQ_09_A1_LEN    (20U)
#define AUDIO_PEQ_09_A1_MSK    (((1U << AUDIO_PEQ_09_A1_LEN) - 1) << AUDIO_PEQ_09_A1_POS)
#define AUDIO_PEQ_09_A1_UMSK   (~(((1U << AUDIO_PEQ_09_A1_LEN) - 1) << AUDIO_PEQ_09_A1_POS))

/* 0x2C4 : peq_09_a2 */
#define AUDIO_PEQ_09_A2_OFFSET (0x2C4)
#define AUDIO_PEQ_09_A2        AUDIO_PEQ_09_A2
#define AUDIO_PEQ_09_A2_POS    (0U)
#define AUDIO_PEQ_09_A2_LEN    (20U)
#define AUDIO_PEQ_09_A2_MSK    (((1U << AUDIO_PEQ_09_A2_LEN) - 1) << AUDIO_PEQ_09_A2_POS)
#define AUDIO_PEQ_09_A2_UMSK   (~(((1U << AUDIO_PEQ_09_A2_LEN) - 1) << AUDIO_PEQ_09_A2_POS))

