bouffalolab/bouffalo_sdk/components/multimedia/xcodec/src/bl606p/drv/msp_audio_reg.h
/* 0x338 : peq_15_a1 */
#define AUDIO_PEQ_15_A1_OFFSET (0x338)
#define AUDIO_PEQ_15_A1        AUDIO_PEQ_15_A1
#define AUDIO_PEQ_15_A1_POS    (0U)
#define AUDIO_PEQ_15_A1_LEN    (20U)
#define AUDIO_PEQ_15_A1_MSK    (((1U << AUDIO_PEQ_15_A1_LEN) - 1) << AUDIO_PEQ_15_A1_POS)
#define AUDIO_PEQ_15_A1_UMSK   (~(((1U << AUDIO_PEQ_15_A1_LEN) - 1) << AUDIO_PEQ_15_A1_POS))

/* 0x33C : peq_15_a2 */
#define AUDIO_PEQ_15_A2_OFFSET (0x33C)
#define AUDIO_PEQ_15_A2        AUDIO_PEQ_15_A2
#define AUDIO_PEQ_15_A2_POS    (0U)
#define AUDIO_PEQ_15_A2_LEN    (20U)
#define AUDIO_PEQ_15_A2_MSK    (((1U << AUDIO_PEQ_15_A2_LEN) - 1) << AUDIO_PEQ_15_A2_POS)
#define AUDIO_PEQ_15_A2_UMSK   (~(((1U << AUDIO_PEQ_15_A2_LEN) - 1) << AUDIO_PEQ_15_A2_POS))

/* 0x340 : peq_16_b0 */
#define AUDIO_PEQ_16_B0_OFFSET (0x340)
#define AUDIO_PEQ_16_B0        AUDIO_PEQ_16_B0
#define AUDIO_PEQ_16_B0_POS    (0U)
#define AUDIO_PEQ_16_B0_LEN    (20U)
#define AUDIO_PEQ_16_B0_MSK    (((1U << AUDIO_PEQ_16_B0_LEN) - 1) << AUDIO_PEQ_16_B0_POS)
#define AUDIO_PEQ_16_B0_UMSK   (~(((1U << AUDIO_PEQ_16_B0_LEN) - 1) << AUDIO_PEQ_16_B0_POS))
#define AUDIO_PEQ_16_BYP       AUDIO_PEQ_16_BYP
#define AUDIO_PEQ_16_BYP_POS   (20U)
#define AUDIO_PEQ_16_BYP_LEN   (1U)
#define AUDIO_PEQ_16_BYP_MSK   (((1U << AUDIO_PEQ_16_BYP_LEN) - 1) << AUDIO_PEQ_16_BYP_POS)
#define AUDIO_PEQ_16_BYP_UMSK  (~(((1U << AUDIO_PEQ_16_BYP_LEN) - 1) << AUDIO_PEQ_16_BYP_POS))
#define AUDIO_PEQ_16_QFMT      AUDIO_PEQ_16_QFMT
#define AUDIO_PEQ_16_QFMT_POS  (21U)
#define AUDIO_PEQ_16_QFMT_LEN  (1U)
#define AUDIO_PEQ_16_QFMT_MSK  (((1U << AUDIO_PEQ_16_QFMT_LEN) - 1) << AUDIO_PEQ_16_QFMT_POS)
#define AUDIO_PEQ_16_QFMT_UMSK (~(((1U << AUDIO_PEQ_16_QFMT_LEN) - 1) << AUDIO_PEQ_16_QFMT_POS))

/* 0x344 : peq_16_b1 */
#define AUDIO_PEQ_16_B1_OFFSET (0x344)
#define AUDIO_PEQ_16_B1        AUDIO_PEQ_16_B1
#define AUDIO_PEQ_16_B1_POS    (0U)
#define AUDIO_PEQ_16_B1_LEN    (20U)
#define AUDIO_PEQ_16_B1_MSK    (((1U << AUDIO_PEQ_16_B1_LEN) - 1) << AUDIO_PEQ_16_B1_POS)
#define AUDIO_PEQ_16_B1_UMSK   (~(((1U << AUDIO_PEQ_16_B1_LEN) - 1) << AUDIO_PEQ_16_B1_POS))

/* 0x348 : peq_16_b2 */
#define AUDIO_PEQ_16_B2_OFFSET (0x348)
#define AUDIO_PEQ_16_B2        AUDIO_PEQ_16_B2
#define AUDIO_PEQ_16_B2_POS    (0U)
#define AUDIO_PEQ_16_B2_LEN    (20U)
#define AUDIO_PEQ_16_B2_MSK    (((1U << AUDIO_PEQ_16_B2_LEN) - 1) << AUDIO_PEQ_16_B2_POS)
#define AUDIO_PEQ_16_B2_UMSK   (~(((1U << AUDIO_PEQ_16_B2_LEN) - 1) << AUDIO_PEQ_16_B2_POS))

/* 0x34C : peq_16_a1 */
#define AUDIO_PEQ_16_A1_OFFSET (0x34C)
#define AUDIO_PEQ_16_A1        AUDIO_PEQ_16_A1
#define AUDIO_PEQ_16_A1_POS    (0U)
#define AUDIO_PEQ_16_A1_LEN    (20U)
#define AUDIO_PEQ_16_A1_MSK    (((1U << AUDIO_PEQ_16_A1_LEN) - 1) << AUDIO_PEQ_16_A1_POS)
#define AUDIO_PEQ_16_A1_UMSK   (~(((1U << AUDIO_PEQ_16_A1_LEN) - 1) << AUDIO_PEQ_16_A1_POS))

/* 0x350 : peq_16_a2 */
#define AUDIO_PEQ_16_A2_OFFSET (0x350)
#define AUDIO_PEQ_16_A2        AUDIO_PEQ_16_A2
#define AUDIO_PEQ_16_A2_POS    (0U)
#define AUDIO_PEQ_16_A2_LEN    (20U)
#define AUDIO_PEQ_16_A2_MSK    (((1U << AUDIO_PEQ_16_A2_LEN) - 1) << AUDIO_PEQ_16_A2_POS)
#define AUDIO_PEQ_16_A2_UMSK   (~(((1U << AUDIO_PEQ_16_A2_LEN) - 1) << AUDIO_PEQ_16_A2_POS))

/* 0x354 : peq_17_b0 */
#define AUDIO_PEQ_17_B0_OFFSET (0x354)
#define AUDIO_PEQ_17_B0        AUDIO_PEQ_17_B0
#define AUDIO_PEQ_17_B0_POS    (0U)
#define AUDIO_PEQ_17_B0_LEN    (20U)
#define AUDIO_PEQ_17_B0_MSK    (((1U << AUDIO_PEQ_17_B0_LEN) - 1) << AUDIO_PEQ_17_B0_POS)
#define AUDIO_PEQ_17_B0_UMSK   (~(((1U << AUDIO_PEQ_17_B0_LEN) - 1) << AUDIO_PEQ_17_B0_POS))
#define AUDIO_PEQ_17_BYP       AUDIO_PEQ_17_BYP
#define AUDIO_PEQ_17_BYP_POS   (20U)
#define AUDIO_PEQ_17_BYP_LEN   (1U)
#define AUDIO_PEQ_17_BYP_MSK   (((1U << AUDIO_PEQ_17_BYP_LEN) - 1) << AUDIO_PEQ_17_BYP_POS)
#define AUDIO_PEQ_17_BYP_UMSK  (~(((1U << AUDIO_PEQ_17_BYP_LEN) - 1) << AUDIO_PEQ_17_BYP_POS))
#define AUDIO_PEQ_17_QFMT      AUDIO_PEQ_17_QFMT
#define AUDIO_PEQ_17_QFMT_POS  (21U)
#define AUDIO_PEQ_17_QFMT_LEN  (1U)
#define AUDIO_PEQ_17_QFMT_MSK  (((1U << AUDIO_PEQ_17_QFMT_LEN) - 1) << AUDIO_PEQ_17_QFMT_POS)
#define AUDIO_PEQ_17_QFMT_UMSK (~(((1U << AUDIO_PEQ_17_QFMT_LEN) - 1) << AUDIO_PEQ_17_QFMT_POS))

/* 0x358 : peq_17_b1 */
#define AUDIO_PEQ_17_B1_OFFSET (0x358)
#define AUDIO_PEQ_17_B1        AUDIO_PEQ_17_B1
#define AUDIO_PEQ_17_B1_POS    (0U)
#define AUDIO_PEQ_17_B1_LEN    (20U)
#define AUDIO_PEQ_17_B1_MSK    (((1U << AUDIO_PEQ_17_B1_LEN) - 1) << AUDIO_PEQ_17_B1_POS)
#define AUDIO_PEQ_17_B1_UMSK   (~(((1U << AUDIO_PEQ_17_B1_LEN) - 1) << AUDIO_PEQ_17_B1_POS))

/* 0x35C : peq_17_b2 */
#define AUDIO_PEQ_17_B2_OFFSET (0x35C)
#define AUDIO_PEQ_17_B2        AUDIO_PEQ_17_B2
#define AUDIO_PEQ_17_B2_POS    (0U)
#define AUDIO_PEQ_17_B2_LEN    (20U)
#define AUDIO_PEQ_17_B2_MSK    (((1U << AUDIO_PEQ_17_B2_LEN) - 1) << AUDIO_PEQ_17_B2_POS)
#define AUDIO_PEQ_17_B2_UMSK   (~(((1U << AUDIO_PEQ_17_B2_LEN) - 1) << AUDIO_PEQ_17_B2_POS))

/* 0x360 : peq_17_a1 */
#define AUDIO_PEQ_17_A1_OFFSET (0x360)
#define AUDIO_PEQ_17_A1        AUDIO_PEQ_17_A1
#define AUDIO_PEQ_17_A1_POS    (0U)
#define AUDIO_PEQ_17_A1_LEN    (20U)
#define AUDIO_PEQ_17_A1_MSK    (((1U << AUDIO_PEQ_17_A1_LEN) - 1) << AUDIO_PEQ_17_A1_POS)
#define AUDIO_PEQ_17_A1_UMSK   (~(((1U << AUDIO_PEQ_17_A1_LEN) - 1) << AUDIO_PEQ_17_A1_POS))

/* 0x364 : peq_17_a2 */
#define AUDIO_PEQ_17_A2_OFFSET (0x364)
#define AUDIO_PEQ_17_A2        AUDIO_PEQ_17_A2
#define AUDIO_PEQ_17_A2_POS    (0U)
#define AUDIO_PEQ_17_A2_LEN    (20U)
#define AUDIO_PEQ_17_A2_MSK    (((1U << AUDIO_PEQ_17_A2_LEN) - 1) << AUDIO_PEQ_17_A2_POS)
#define AUDIO_PEQ_17_A2_UMSK   (~(((1U << AUDIO_PEQ_17_A2_LEN) - 1) << AUDIO_PEQ_17_A2_POS))

/* 0x368 : peq_18_b0 */
#define AUDIO_PEQ_18_B0_OFFSET (0x368)
#define AUDIO_PEQ_18_B0        AUDIO_PEQ_18_B0
#define AUDIO_PEQ_18_B0_POS    (0U)
#define AUDIO_PEQ_18_B0_LEN    (20U)
#define AUDIO_PEQ_18_B0_MSK    (((1U << AUDIO_PEQ_18_B0_LEN) - 1) << AUDIO_PEQ_18_B0_POS)
#define AUDIO_PEQ_18_B0_UMSK   (~(((1U << AUDIO_PEQ_18_B0_LEN) - 1) << AUDIO_PEQ_18_B0_POS))
#define AUDIO_PEQ_18_BYP       AUDIO_PEQ_18_BYP
#define AUDIO_PEQ_18_BYP_POS   (20U)
#define AUDIO_PEQ_18_BYP_LEN   (1U)
#define AUDIO_PEQ_18_BYP_MSK   (((1U << AUDIO_PEQ_18_BYP_LEN) - 1) << AUDIO_PEQ_18_BYP_POS)
#define AUDIO_PEQ_18_BYP_UMSK  (~(((1U << AUDIO_PEQ_18_BYP_LEN) - 1) << AUDIO_PEQ_18_BYP_POS))
#define AUDIO_PEQ_18_QFMT      AUDIO_PEQ_18_QFMT
#define AUDIO_PEQ_18_QFMT_POS  (21U)
#define AUDIO_PEQ_18_QFMT_LEN  (1U)
#define AUDIO_PEQ_18_QFMT_MSK  (((1U << AUDIO_PEQ_18_QFMT_LEN) - 1) << AUDIO_PEQ_18_QFMT_POS)
#define AUDIO_PEQ_18_QFMT_UMSK (~(((1U << AUDIO_PEQ_18_QFMT_LEN) - 1) << AUDIO_PEQ_18_QFMT_POS))

