bouffalolab/bouffalo_sdk/components/multimedia/xcodec/src/bl606p/drv/msp_audio_reg.h
/* 0x3A8 : peq_21_b1 */
#define AUDIO_PEQ_21_B1_OFFSET (0x3A8)
#define AUDIO_PEQ_21_B1        AUDIO_PEQ_21_B1
#define AUDIO_PEQ_21_B1_POS    (0U)
#define AUDIO_PEQ_21_B1_LEN    (20U)
#define AUDIO_PEQ_21_B1_MSK    (((1U << AUDIO_PEQ_21_B1_LEN) - 1) << AUDIO_PEQ_21_B1_POS)
#define AUDIO_PEQ_21_B1_UMSK   (~(((1U << AUDIO_PEQ_21_B1_LEN) - 1) << AUDIO_PEQ_21_B1_POS))

/* 0x3AC : peq_21_b2 */
#define AUDIO_PEQ_21_B2_OFFSET (0x3AC)
#define AUDIO_PEQ_21_B2        AUDIO_PEQ_21_B2
#define AUDIO_PEQ_21_B2_POS    (0U)
#define AUDIO_PEQ_21_B2_LEN    (20U)
#define AUDIO_PEQ_21_B2_MSK    (((1U << AUDIO_PEQ_21_B2_LEN) - 1) << AUDIO_PEQ_21_B2_POS)
#define AUDIO_PEQ_21_B2_UMSK   (~(((1U << AUDIO_PEQ_21_B2_LEN) - 1) << AUDIO_PEQ_21_B2_POS))

/* 0x3B0 : peq_21_a1 */
#define AUDIO_PEQ_21_A1_OFFSET (0x3B0)
#define AUDIO_PEQ_21_A1        AUDIO_PEQ_21_A1
#define AUDIO_PEQ_21_A1_POS    (0U)
#define AUDIO_PEQ_21_A1_LEN    (20U)
#define AUDIO_PEQ_21_A1_MSK    (((1U << AUDIO_PEQ_21_A1_LEN) - 1) << AUDIO_PEQ_21_A1_POS)
#define AUDIO_PEQ_21_A1_UMSK   (~(((1U << AUDIO_PEQ_21_A1_LEN) - 1) << AUDIO_PEQ_21_A1_POS))

/* 0x3B4 : peq_21_a2 */
#define AUDIO_PEQ_21_A2_OFFSET (0x3B4)
#define AUDIO_PEQ_21_A2        AUDIO_PEQ_21_A2
#define AUDIO_PEQ_21_A2_POS    (0U)
#define AUDIO_PEQ_21_A2_LEN    (20U)
#define AUDIO_PEQ_21_A2_MSK    (((1U << AUDIO_PEQ_21_A2_LEN) - 1) << AUDIO_PEQ_21_A2_POS)
#define AUDIO_PEQ_21_A2_UMSK   (~(((1U << AUDIO_PEQ_21_A2_LEN) - 1) << AUDIO_PEQ_21_A2_POS))

/* 0x3B8 : peq_22_b0 */
#define AUDIO_PEQ_22_B0_OFFSET (0x3B8)
#define AUDIO_PEQ_22_B0        AUDIO_PEQ_22_B0
#define AUDIO_PEQ_22_B0_POS    (0U)
#define AUDIO_PEQ_22_B0_LEN    (20U)
#define AUDIO_PEQ_22_B0_MSK    (((1U << AUDIO_PEQ_22_B0_LEN) - 1) << AUDIO_PEQ_22_B0_POS)
#define AUDIO_PEQ_22_B0_UMSK   (~(((1U << AUDIO_PEQ_22_B0_LEN) - 1) << AUDIO_PEQ_22_B0_POS))
#define AUDIO_PEQ_22_BYP       AUDIO_PEQ_22_BYP
#define AUDIO_PEQ_22_BYP_POS   (20U)
#define AUDIO_PEQ_22_BYP_LEN   (1U)
#define AUDIO_PEQ_22_BYP_MSK   (((1U << AUDIO_PEQ_22_BYP_LEN) - 1) << AUDIO_PEQ_22_BYP_POS)
#define AUDIO_PEQ_22_BYP_UMSK  (~(((1U << AUDIO_PEQ_22_BYP_LEN) - 1) << AUDIO_PEQ_22_BYP_POS))
#define AUDIO_PEQ_22_QFMT      AUDIO_PEQ_22_QFMT
#define AUDIO_PEQ_22_QFMT_POS  (21U)
#define AUDIO_PEQ_22_QFMT_LEN  (1U)
#define AUDIO_PEQ_22_QFMT_MSK  (((1U << AUDIO_PEQ_22_QFMT_LEN) - 1) << AUDIO_PEQ_22_QFMT_POS)
#define AUDIO_PEQ_22_QFMT_UMSK (~(((1U << AUDIO_PEQ_22_QFMT_LEN) - 1) << AUDIO_PEQ_22_QFMT_POS))

/* 0x3BC : peq_22_b1 */
#define AUDIO_PEQ_22_B1_OFFSET (0x3BC)
#define AUDIO_PEQ_22_B1        AUDIO_PEQ_22_B1
#define AUDIO_PEQ_22_B1_POS    (0U)
#define AUDIO_PEQ_22_B1_LEN    (20U)
#define AUDIO_PEQ_22_B1_MSK    (((1U << AUDIO_PEQ_22_B1_LEN) - 1) << AUDIO_PEQ_22_B1_POS)
#define AUDIO_PEQ_22_B1_UMSK   (~(((1U << AUDIO_PEQ_22_B1_LEN) - 1) << AUDIO_PEQ_22_B1_POS))

/* 0x3C0 : peq_22_b2 */
#define AUDIO_PEQ_22_B2_OFFSET (0x3C0)
#define AUDIO_PEQ_22_B2        AUDIO_PEQ_22_B2
#define AUDIO_PEQ_22_B2_POS    (0U)
#define AUDIO_PEQ_22_B2_LEN    (20U)
#define AUDIO_PEQ_22_B2_MSK    (((1U << AUDIO_PEQ_22_B2_LEN) - 1) << AUDIO_PEQ_22_B2_POS)
#define AUDIO_PEQ_22_B2_UMSK   (~(((1U << AUDIO_PEQ_22_B2_LEN) - 1) << AUDIO_PEQ_22_B2_POS))

/* 0x3C4 : peq_22_a1 */
#define AUDIO_PEQ_22_A1_OFFSET (0x3C4)
#define AUDIO_PEQ_22_A1        AUDIO_PEQ_22_A1
#define AUDIO_PEQ_22_A1_POS    (0U)
#define AUDIO_PEQ_22_A1_LEN    (20U)
#define AUDIO_PEQ_22_A1_MSK    (((1U << AUDIO_PEQ_22_A1_LEN) - 1) << AUDIO_PEQ_22_A1_POS)
#define AUDIO_PEQ_22_A1_UMSK   (~(((1U << AUDIO_PEQ_22_A1_LEN) - 1) << AUDIO_PEQ_22_A1_POS))

/* 0x3C8 : peq_22_a2 */
#define AUDIO_PEQ_22_A2_OFFSET (0x3C8)
#define AUDIO_PEQ_22_A2        AUDIO_PEQ_22_A2
#define AUDIO_PEQ_22_A2_POS    (0U)
#define AUDIO_PEQ_22_A2_LEN    (20U)
#define AUDIO_PEQ_22_A2_MSK    (((1U << AUDIO_PEQ_22_A2_LEN) - 1) << AUDIO_PEQ_22_A2_POS)
#define AUDIO_PEQ_22_A2_UMSK   (~(((1U << AUDIO_PEQ_22_A2_LEN) - 1) << AUDIO_PEQ_22_A2_POS))

/* 0x3CC : peq_23_b0 */
#define AUDIO_PEQ_23_B0_OFFSET (0x3CC)
#define AUDIO_PEQ_23_B0        AUDIO_PEQ_23_B0
#define AUDIO_PEQ_23_B0_POS    (0U)
#define AUDIO_PEQ_23_B0_LEN    (20U)
#define AUDIO_PEQ_23_B0_MSK    (((1U << AUDIO_PEQ_23_B0_LEN) - 1) << AUDIO_PEQ_23_B0_POS)
#define AUDIO_PEQ_23_B0_UMSK   (~(((1U << AUDIO_PEQ_23_B0_LEN) - 1) << AUDIO_PEQ_23_B0_POS))
#define AUDIO_PEQ_23_BYP       AUDIO_PEQ_23_BYP
#define AUDIO_PEQ_23_BYP_POS   (20U)
#define AUDIO_PEQ_23_BYP_LEN   (1U)
#define AUDIO_PEQ_23_BYP_MSK   (((1U << AUDIO_PEQ_23_BYP_LEN) - 1) << AUDIO_PEQ_23_BYP_POS)
#define AUDIO_PEQ_23_BYP_UMSK  (~(((1U << AUDIO_PEQ_23_BYP_LEN) - 1) << AUDIO_PEQ_23_BYP_POS))
#define AUDIO_PEQ_23_QFMT      AUDIO_PEQ_23_QFMT
#define AUDIO_PEQ_23_QFMT_POS  (21U)
#define AUDIO_PEQ_23_QFMT_LEN  (1U)
#define AUDIO_PEQ_23_QFMT_MSK  (((1U << AUDIO_PEQ_23_QFMT_LEN) - 1) << AUDIO_PEQ_23_QFMT_POS)
#define AUDIO_PEQ_23_QFMT_UMSK (~(((1U << AUDIO_PEQ_23_QFMT_LEN) - 1) << AUDIO_PEQ_23_QFMT_POS))

/* 0x3D0 : peq_23_b1 */
#define AUDIO_PEQ_23_B1_OFFSET (0x3D0)
#define AUDIO_PEQ_23_B1        AUDIO_PEQ_23_B1
#define AUDIO_PEQ_23_B1_POS    (0U)
#define AUDIO_PEQ_23_B1_LEN    (20U)
#define AUDIO_PEQ_23_B1_MSK    (((1U << AUDIO_PEQ_23_B1_LEN) - 1) << AUDIO_PEQ_23_B1_POS)
#define AUDIO_PEQ_23_B1_UMSK   (~(((1U << AUDIO_PEQ_23_B1_LEN) - 1) << AUDIO_PEQ_23_B1_POS))

/* 0x3D4 : peq_23_b2 */
#define AUDIO_PEQ_23_B2_OFFSET (0x3D4)
#define AUDIO_PEQ_23_B2        AUDIO_PEQ_23_B2
#define AUDIO_PEQ_23_B2_POS    (0U)
#define AUDIO_PEQ_23_B2_LEN    (20U)
#define AUDIO_PEQ_23_B2_MSK    (((1U << AUDIO_PEQ_23_B2_LEN) - 1) << AUDIO_PEQ_23_B2_POS)
#define AUDIO_PEQ_23_B2_UMSK   (~(((1U << AUDIO_PEQ_23_B2_LEN) - 1) << AUDIO_PEQ_23_B2_POS))

/* 0x3D8 : peq_23_a1 */
#define AUDIO_PEQ_23_A1_OFFSET (0x3D8)
#define AUDIO_PEQ_23_A1        AUDIO_PEQ_23_A1
#define AUDIO_PEQ_23_A1_POS    (0U)
#define AUDIO_PEQ_23_A1_LEN    (20U)
#define AUDIO_PEQ_23_A1_MSK    (((1U << AUDIO_PEQ_23_A1_LEN) - 1) << AUDIO_PEQ_23_A1_POS)
#define AUDIO_PEQ_23_A1_UMSK   (~(((1U << AUDIO_PEQ_23_A1_LEN) - 1) << AUDIO_PEQ_23_A1_POS))

/* 0x3DC : peq_23_a2 */
#define AUDIO_PEQ_23_A2_OFFSET (0x3DC)
#define AUDIO_PEQ_23_A2        AUDIO_PEQ_23_A2
#define AUDIO_PEQ_23_A2_POS    (0U)
#define AUDIO_PEQ_23_A2_LEN    (20U)
#define AUDIO_PEQ_23_A2_MSK    (((1U << AUDIO_PEQ_23_A2_LEN) - 1) << AUDIO_PEQ_23_A2_POS)
#define AUDIO_PEQ_23_A2_UMSK   (~(((1U << AUDIO_PEQ_23_A2_LEN) - 1) << AUDIO_PEQ_23_A2_POS))

/* 0x3E0 : peq_24_b0 */
#define AUDIO_PEQ_24_B0_OFFSET (0x3E0)
#define AUDIO_PEQ_24_B0        AUDIO_PEQ_24_B0
#define AUDIO_PEQ_24_B0_POS    (0U)
#define AUDIO_PEQ_24_B0_LEN    (20U)
#define AUDIO_PEQ_24_B0_MSK    (((1U << AUDIO_PEQ_24_B0_LEN) - 1) << AUDIO_PEQ_24_B0_POS)
#define AUDIO_PEQ_24_B0_UMSK   (~(((1U << AUDIO_PEQ_24_B0_LEN) - 1) << AUDIO_PEQ_24_B0_POS))
#define AUDIO_PEQ_24_BYP       AUDIO_PEQ_24_BYP
#define AUDIO_PEQ_24_BYP_POS   (20U)
#define AUDIO_PEQ_24_BYP_LEN   (1U)
#define AUDIO_PEQ_24_BYP_MSK   (((1U << AUDIO_PEQ_24_BYP_LEN) - 1) << AUDIO_PEQ_24_BYP_POS)
#define AUDIO_PEQ_24_BYP_UMSK  (~(((1U << AUDIO_PEQ_24_BYP_LEN) - 1) << AUDIO_PEQ_24_BYP_POS))
#define AUDIO_PEQ_24_QFMT      AUDIO_PEQ_24_QFMT
#define AUDIO_PEQ_24_QFMT_POS  (21U)
#define AUDIO_PEQ_24_QFMT_LEN  (1U)
#define AUDIO_PEQ_24_QFMT_MSK  (((1U << AUDIO_PEQ_24_QFMT_LEN) - 1) << AUDIO_PEQ_24_QFMT_POS)
#define AUDIO_PEQ_24_QFMT_UMSK (~(((1U << AUDIO_PEQ_24_QFMT_LEN) - 1) << AUDIO_PEQ_24_QFMT_POS))

