bouffalolab/bouffalo_sdk/components/multimedia/xcodec/src/bl606p/drv/msp_audio_reg.h
/* 0x3E4 : peq_24_b1 */
#define AUDIO_PEQ_24_B1_OFFSET (0x3E4)
#define AUDIO_PEQ_24_B1        AUDIO_PEQ_24_B1
#define AUDIO_PEQ_24_B1_POS    (0U)
#define AUDIO_PEQ_24_B1_LEN    (20U)
#define AUDIO_PEQ_24_B1_MSK    (((1U << AUDIO_PEQ_24_B1_LEN) - 1) << AUDIO_PEQ_24_B1_POS)
#define AUDIO_PEQ_24_B1_UMSK   (~(((1U << AUDIO_PEQ_24_B1_LEN) - 1) << AUDIO_PEQ_24_B1_POS))

/* 0x3E8 : peq_24_b2 */
#define AUDIO_PEQ_24_B2_OFFSET (0x3E8)
#define AUDIO_PEQ_24_B2        AUDIO_PEQ_24_B2
#define AUDIO_PEQ_24_B2_POS    (0U)
#define AUDIO_PEQ_24_B2_LEN    (20U)
#define AUDIO_PEQ_24_B2_MSK    (((1U << AUDIO_PEQ_24_B2_LEN) - 1) << AUDIO_PEQ_24_B2_POS)
#define AUDIO_PEQ_24_B2_UMSK   (~(((1U << AUDIO_PEQ_24_B2_LEN) - 1) << AUDIO_PEQ_24_B2_POS))

/* 0x3EC : peq_24_a1 */
#define AUDIO_PEQ_24_A1_OFFSET (0x3EC)
#define AUDIO_PEQ_24_A1        AUDIO_PEQ_24_A1
#define AUDIO_PEQ_24_A1_POS    (0U)
#define AUDIO_PEQ_24_A1_LEN    (20U)
#define AUDIO_PEQ_24_A1_MSK    (((1U << AUDIO_PEQ_24_A1_LEN) - 1) << AUDIO_PEQ_24_A1_POS)
#define AUDIO_PEQ_24_A1_UMSK   (~(((1U << AUDIO_PEQ_24_A1_LEN) - 1) << AUDIO_PEQ_24_A1_POS))

/* 0x3F0 : peq_24_a2 */
#define AUDIO_PEQ_24_A2_OFFSET (0x3F0)
#define AUDIO_PEQ_24_A2        AUDIO_PEQ_24_A2
#define AUDIO_PEQ_24_A2_POS    (0U)
#define AUDIO_PEQ_24_A2_LEN    (20U)
#define AUDIO_PEQ_24_A2_MSK    (((1U << AUDIO_PEQ_24_A2_LEN) - 1) << AUDIO_PEQ_24_A2_POS)
#define AUDIO_PEQ_24_A2_UMSK   (~(((1U << AUDIO_PEQ_24_A2_LEN) - 1) << AUDIO_PEQ_24_A2_POS))

/* 0x400 : adc_h */
#define AUDIO_ADC_H_OFFSET               (0x400)
#define AUDIO_ADC_H_CTRL_RMP_RATE        AUDIO_ADC_H_CTRL_RMP_RATE
#define AUDIO_ADC_H_CTRL_RMP_RATE_POS    (2U)
#define AUDIO_ADC_H_CTRL_RMP_RATE_LEN    (4U)
#define AUDIO_ADC_H_CTRL_RMP_RATE_MSK    (((1U << AUDIO_ADC_H_CTRL_RMP_RATE_LEN) - 1) << AUDIO_ADC_H_CTRL_RMP_RATE_POS)
#define AUDIO_ADC_H_CTRL_RMP_RATE_UMSK   (~(((1U << AUDIO_ADC_H_CTRL_RMP_RATE_LEN) - 1) << AUDIO_ADC_H_CTRL_RMP_RATE_POS))
#define AUDIO_ADC_H_CTRL_ZCD_RATE        AUDIO_ADC_H_CTRL_ZCD_RATE
#define AUDIO_ADC_H_CTRL_ZCD_RATE_POS    (6U)
#define AUDIO_ADC_H_CTRL_ZCD_RATE_LEN    (4U)
#define AUDIO_ADC_H_CTRL_ZCD_RATE_MSK    (((1U << AUDIO_ADC_H_CTRL_ZCD_RATE_LEN) - 1) << AUDIO_ADC_H_CTRL_ZCD_RATE_POS)
#define AUDIO_ADC_H_CTRL_ZCD_RATE_UMSK   (~(((1U << AUDIO_ADC_H_CTRL_ZCD_RATE_LEN) - 1) << AUDIO_ADC_H_CTRL_ZCD_RATE_POS))
#define AUDIO_ADC_H_CTRL_MODE            AUDIO_ADC_H_CTRL_MODE
#define AUDIO_ADC_H_CTRL_MODE_POS        (10U)
#define AUDIO_ADC_H_CTRL_MODE_LEN        (2U)
#define AUDIO_ADC_H_CTRL_MODE_MSK        (((1U << AUDIO_ADC_H_CTRL_MODE_LEN) - 1) << AUDIO_ADC_H_CTRL_MODE_POS)
#define AUDIO_ADC_H_CTRL_MODE_UMSK       (~(((1U << AUDIO_ADC_H_CTRL_MODE_LEN) - 1) << AUDIO_ADC_H_CTRL_MODE_POS))
#define AUDIO_ADC_H_VOLUME_UPDATE        AUDIO_ADC_H_VOLUME_UPDATE
#define AUDIO_ADC_H_VOLUME_UPDATE_POS    (12U)
#define AUDIO_ADC_H_VOLUME_UPDATE_LEN    (1U)
#define AUDIO_ADC_H_VOLUME_UPDATE_MSK    (((1U << AUDIO_ADC_H_VOLUME_UPDATE_LEN) - 1) << AUDIO_ADC_H_VOLUME_UPDATE_POS)
#define AUDIO_ADC_H_VOLUME_UPDATE_UMSK   (~(((1U << AUDIO_ADC_H_VOLUME_UPDATE_LEN) - 1) << AUDIO_ADC_H_VOLUME_UPDATE_POS))
#define AUDIO_ADC_H_VOLUME               AUDIO_ADC_H_VOLUME
#define AUDIO_ADC_H_VOLUME_POS           (13U)
#define AUDIO_ADC_H_VOLUME_LEN           (9U)
#define AUDIO_ADC_H_VOLUME_MSK           (((1U << AUDIO_ADC_H_VOLUME_LEN) - 1) << AUDIO_ADC_H_VOLUME_POS)
#define AUDIO_ADC_H_VOLUME_UMSK          (~(((1U << AUDIO_ADC_H_VOLUME_LEN) - 1) << AUDIO_ADC_H_VOLUME_POS))
#define AUDIO_ADC_H_MUTE_RMPUP_RATE      AUDIO_ADC_H_MUTE_RMPUP_RATE
#define AUDIO_ADC_H_MUTE_RMPUP_RATE_POS  (22U)
#define AUDIO_ADC_H_MUTE_RMPUP_RATE_LEN  (4U)
#define AUDIO_ADC_H_MUTE_RMPUP_RATE_MSK  (((1U << AUDIO_ADC_H_MUTE_RMPUP_RATE_LEN) - 1) << AUDIO_ADC_H_MUTE_RMPUP_RATE_POS)
#define AUDIO_ADC_H_MUTE_RMPUP_RATE_UMSK (~(((1U << AUDIO_ADC_H_MUTE_RMPUP_RATE_LEN) - 1) << AUDIO_ADC_H_MUTE_RMPUP_RATE_POS))
#define AUDIO_ADC_H_MUTE_RMPDN_RATE      AUDIO_ADC_H_MUTE_RMPDN_RATE
#define AUDIO_ADC_H_MUTE_RMPDN_RATE_POS  (26U)
#define AUDIO_ADC_H_MUTE_RMPDN_RATE_LEN  (4U)
#define AUDIO_ADC_H_MUTE_RMPDN_RATE_MSK  (((1U << AUDIO_ADC_H_MUTE_RMPDN_RATE_LEN) - 1) << AUDIO_ADC_H_MUTE_RMPDN_RATE_POS)
#define AUDIO_ADC_H_MUTE_RMPDN_RATE_UMSK (~(((1U << AUDIO_ADC_H_MUTE_RMPDN_RATE_LEN) - 1) << AUDIO_ADC_H_MUTE_RMPDN_RATE_POS))
#define AUDIO_ADC_H_MUTE_SOFTMODE        AUDIO_ADC_H_MUTE_SOFTMODE
#define AUDIO_ADC_H_MUTE_SOFTMODE_POS    (30U)
#define AUDIO_ADC_H_MUTE_SOFTMODE_LEN    (1U)
#define AUDIO_ADC_H_MUTE_SOFTMODE_MSK    (((1U << AUDIO_ADC_H_MUTE_SOFTMODE_LEN) - 1) << AUDIO_ADC_H_MUTE_SOFTMODE_POS)
#define AUDIO_ADC_H_MUTE_SOFTMODE_UMSK   (~(((1U << AUDIO_ADC_H_MUTE_SOFTMODE_LEN) - 1) << AUDIO_ADC_H_MUTE_SOFTMODE_POS))
#define AUDIO_ADC_H_MUTE                 AUDIO_ADC_H_MUTE
#define AUDIO_ADC_H_MUTE_POS             (31U)
#define AUDIO_ADC_H_MUTE_LEN             (1U)
#define AUDIO_ADC_H_MUTE_MSK             (((1U << AUDIO_ADC_H_MUTE_LEN) - 1) << AUDIO_ADC_H_MUTE_POS)
#define AUDIO_ADC_H_MUTE_UMSK            (~(((1U << AUDIO_ADC_H_MUTE_LEN) - 1) << AUDIO_ADC_H_MUTE_POS))

/* 0x404 : adc_h_misc */
#define AUDIO_ADC_H_MISC_OFFSET           (0x404)
#define AUDIO_ADC_H_CTRL_ZCD_TIMEOUT      AUDIO_ADC_H_CTRL_ZCD_TIMEOUT
#define AUDIO_ADC_H_CTRL_ZCD_TIMEOUT_POS  (28U)
#define AUDIO_ADC_H_CTRL_ZCD_TIMEOUT_LEN  (4U)
#define AUDIO_ADC_H_CTRL_ZCD_TIMEOUT_MSK  (((1U << AUDIO_ADC_H_CTRL_ZCD_TIMEOUT_LEN) - 1) << AUDIO_ADC_H_CTRL_ZCD_TIMEOUT_POS)
#define AUDIO_ADC_H_CTRL_ZCD_TIMEOUT_UMSK (~(((1U << AUDIO_ADC_H_CTRL_ZCD_TIMEOUT_LEN) - 1) << AUDIO_ADC_H_CTRL_ZCD_TIMEOUT_POS))

/* 0x408 : adc_s0 */
#define AUDIO_ADC_S0_OFFSET               (0x408)
#define AUDIO_ADC_S0_CTRL_RMP_RATE        AUDIO_ADC_S0_CTRL_RMP_RATE
#define AUDIO_ADC_S0_CTRL_RMP_RATE_POS    (2U)
#define AUDIO_ADC_S0_CTRL_RMP_RATE_LEN    (4U)
#define AUDIO_ADC_S0_CTRL_RMP_RATE_MSK    (((1U << AUDIO_ADC_S0_CTRL_RMP_RATE_LEN) - 1) << AUDIO_ADC_S0_CTRL_RMP_RATE_POS)
#define AUDIO_ADC_S0_CTRL_RMP_RATE_UMSK   (~(((1U << AUDIO_ADC_S0_CTRL_RMP_RATE_LEN) - 1) << AUDIO_ADC_S0_CTRL_RMP_RATE_POS))
#define AUDIO_ADC_S0_CTRL_ZCD_RATE        AUDIO_ADC_S0_CTRL_ZCD_RATE
#define AUDIO_ADC_S0_CTRL_ZCD_RATE_POS    (6U)
#define AUDIO_ADC_S0_CTRL_ZCD_RATE_LEN    (4U)
#define AUDIO_ADC_S0_CTRL_ZCD_RATE_MSK    (((1U << AUDIO_ADC_S0_CTRL_ZCD_RATE_LEN) - 1) << AUDIO_ADC_S0_CTRL_ZCD_RATE_POS)
#define AUDIO_ADC_S0_CTRL_ZCD_RATE_UMSK   (~(((1U << AUDIO_ADC_S0_CTRL_ZCD_RATE_LEN) - 1) << AUDIO_ADC_S0_CTRL_ZCD_RATE_POS))
#define AUDIO_ADC_S0_CTRL_MODE            AUDIO_ADC_S0_CTRL_MODE
#define AUDIO_ADC_S0_CTRL_MODE_POS        (10U)
#define AUDIO_ADC_S0_CTRL_MODE_LEN        (2U)
#define AUDIO_ADC_S0_CTRL_MODE_MSK        (((1U << AUDIO_ADC_S0_CTRL_MODE_LEN) - 1) << AUDIO_ADC_S0_CTRL_MODE_POS)
#define AUDIO_ADC_S0_CTRL_MODE_UMSK       (~(((1U << AUDIO_ADC_S0_CTRL_MODE_LEN) - 1) << AUDIO_ADC_S0_CTRL_MODE_POS))
#define AUDIO_ADC_S0_VOLUME_UPDATE        AUDIO_ADC_S0_VOLUME_UPDATE
#define AUDIO_ADC_S0_VOLUME_UPDATE_POS    (12U)
#define AUDIO_ADC_S0_VOLUME_UPDATE_LEN    (1U)
#define AUDIO_ADC_S0_VOLUME_UPDATE_MSK    (((1U << AUDIO_ADC_S0_VOLUME_UPDATE_LEN) - 1) << AUDIO_ADC_S0_VOLUME_UPDATE_POS)
#define AUDIO_ADC_S0_VOLUME_UPDATE_UMSK   (~(((1U << AUDIO_ADC_S0_VOLUME_UPDATE_LEN) - 1) << AUDIO_ADC_S0_VOLUME_UPDATE_POS))
#define AUDIO_ADC_S0_VOLUME               AUDIO_ADC_S0_VOLUME
#define AUDIO_ADC_S0_VOLUME_POS           (13U)
#define AUDIO_ADC_S0_VOLUME_LEN           (9U)
#define AUDIO_ADC_S0_VOLUME_MSK           (((1U << AUDIO_ADC_S0_VOLUME_LEN) - 1) << AUDIO_ADC_S0_VOLUME_POS)
#define AUDIO_ADC_S0_VOLUME_UMSK          (~(((1U << AUDIO_ADC_S0_VOLUME_LEN) - 1) << AUDIO_ADC_S0_VOLUME_POS))
#define AUDIO_ADC_S0_MUTE_RMPUP_RATE      AUDIO_ADC_S0_MUTE_RMPUP_RATE
#define AUDIO_ADC_S0_MUTE_RMPUP_RATE_POS  (22U)
#define AUDIO_ADC_S0_MUTE_RMPUP_RATE_LEN  (4U)
#define AUDIO_ADC_S0_MUTE_RMPUP_RATE_MSK  (((1U << AUDIO_ADC_S0_MUTE_RMPUP_RATE_LEN) - 1) << AUDIO_ADC_S0_MUTE_RMPUP_RATE_POS)
#define AUDIO_ADC_S0_MUTE_RMPUP_RATE_UMSK (~(((1U << AUDIO_ADC_S0_MUTE_RMPUP_RATE_LEN) - 1) << AUDIO_ADC_S0_MUTE_RMPUP_RATE_POS))
#define AUDIO_ADC_S0_MUTE_RMPDN_RATE      AUDIO_ADC_S0_MUTE_RMPDN_RATE
#define AUDIO_ADC_S0_MUTE_RMPDN_RATE_POS  (26U)
#define AUDIO_ADC_S0_MUTE_RMPDN_RATE_LEN  (4U)
#define AUDIO_ADC_S0_MUTE_RMPDN_RATE_MSK  (((1U << AUDIO_ADC_S0_MUTE_RMPDN_RATE_LEN) - 1) << AUDIO_ADC_S0_MUTE_RMPDN_RATE_POS)
#define AUDIO_ADC_S0_MUTE_RMPDN_RATE_UMSK (~(((1U << AUDIO_ADC_S0_MUTE_RMPDN_RATE_LEN) - 1) << AUDIO_ADC_S0_MUTE_RMPDN_RATE_POS))
#define AUDIO_ADC_S0_MUTE_SOFTMODE        AUDIO_ADC_S0_MUTE_SOFTMODE
#define AUDIO_ADC_S0_MUTE_SOFTMODE_POS    (30U)
#define AUDIO_ADC_S0_MUTE_SOFTMODE_LEN    (1U)
#define AUDIO_ADC_S0_MUTE_SOFTMODE_MSK    (((1U << AUDIO_ADC_S0_MUTE_SOFTMODE_LEN) - 1) << AUDIO_ADC_S0_MUTE_SOFTMODE_POS)
#define AUDIO_ADC_S0_MUTE_SOFTMODE_UMSK   (~(((1U << AUDIO_ADC_S0_MUTE_SOFTMODE_LEN) - 1) << AUDIO_ADC_S0_MUTE_SOFTMODE_POS))
#define AUDIO_ADC_S0_MUTE                 AUDIO_ADC_S0_MUTE
#define AUDIO_ADC_S0_MUTE_POS             (31U)
#define AUDIO_ADC_S0_MUTE_LEN             (1U)
#define AUDIO_ADC_S0_MUTE_MSK             (((1U << AUDIO_ADC_S0_MUTE_LEN) - 1) << AUDIO_ADC_S0_MUTE_POS)
#define AUDIO_ADC_S0_MUTE_UMSK            (~(((1U << AUDIO_ADC_S0_MUTE_LEN) - 1) << AUDIO_ADC_S0_MUTE_POS))

