bouffalolab/bouffalo_sdk/components/multimedia/xcodec/src/bl606p/drv/msp_audio_reg.h
/* 0x70C : codec_dac_ramp */
#define AUDIO_CODEC_DAC_RAMP_OFFSET           (0x70C)
#define AUDIO_DAC_RG_LO_VREF_RAMP_DCL_EN      AUDIO_DAC_RG_LO_VREF_RAMP_DCL_EN
#define AUDIO_DAC_RG_LO_VREF_RAMP_DCL_EN_POS  (0U)
#define AUDIO_DAC_RG_LO_VREF_RAMP_DCL_EN_LEN  (1U)
#define AUDIO_DAC_RG_LO_VREF_RAMP_DCL_EN_MSK  (((1U << AUDIO_DAC_RG_LO_VREF_RAMP_DCL_EN_LEN) - 1) << AUDIO_DAC_RG_LO_VREF_RAMP_DCL_EN_POS)
#define AUDIO_DAC_RG_LO_VREF_RAMP_DCL_EN_UMSK (~(((1U << AUDIO_DAC_RG_LO_VREF_RAMP_DCL_EN_LEN) - 1) << AUDIO_DAC_RG_LO_VREF_RAMP_DCL_EN_POS))
#define AUDIO_DAC_RG_LINEOUT_VO_PULLDOWN      AUDIO_DAC_RG_LINEOUT_VO_PULLDOWN
#define AUDIO_DAC_RG_LINEOUT_VO_PULLDOWN_POS  (1U)
#define AUDIO_DAC_RG_LINEOUT_VO_PULLDOWN_LEN  (1U)
#define AUDIO_DAC_RG_LINEOUT_VO_PULLDOWN_MSK  (((1U << AUDIO_DAC_RG_LINEOUT_VO_PULLDOWN_LEN) - 1) << AUDIO_DAC_RG_LINEOUT_VO_PULLDOWN_POS)
#define AUDIO_DAC_RG_LINEOUT_VO_PULLDOWN_UMSK (~(((1U << AUDIO_DAC_RG_LINEOUT_VO_PULLDOWN_LEN) - 1) << AUDIO_DAC_RG_LINEOUT_VO_PULLDOWN_POS))
#define AUDIO_DAC_RG_PU_VREF_RAMP             AUDIO_DAC_RG_PU_VREF_RAMP
#define AUDIO_DAC_RG_PU_VREF_RAMP_POS         (2U)
#define AUDIO_DAC_RG_PU_VREF_RAMP_LEN         (1U)
#define AUDIO_DAC_RG_PU_VREF_RAMP_MSK         (((1U << AUDIO_DAC_RG_PU_VREF_RAMP_LEN) - 1) << AUDIO_DAC_RG_PU_VREF_RAMP_POS)
#define AUDIO_DAC_RG_PU_VREF_RAMP_UMSK        (~(((1U << AUDIO_DAC_RG_PU_VREF_RAMP_LEN) - 1) << AUDIO_DAC_RG_PU_VREF_RAMP_POS))
#define AUDIO_DAC_RG_PU_LINEOUT               AUDIO_DAC_RG_PU_LINEOUT
#define AUDIO_DAC_RG_PU_LINEOUT_POS           (3U)
#define AUDIO_DAC_RG_PU_LINEOUT_LEN           (1U)
#define AUDIO_DAC_RG_PU_LINEOUT_MSK           (((1U << AUDIO_DAC_RG_PU_LINEOUT_LEN) - 1) << AUDIO_DAC_RG_PU_LINEOUT_POS)
#define AUDIO_DAC_RG_PU_LINEOUT_UMSK          (~(((1U << AUDIO_DAC_RG_PU_LINEOUT_LEN) - 1) << AUDIO_DAC_RG_PU_LINEOUT_POS))
#define AUDIO_DAC_RG_VREF_RAMP_STEP_T         AUDIO_DAC_RG_VREF_RAMP_STEP_T
#define AUDIO_DAC_RG_VREF_RAMP_STEP_T_POS     (4U)
#define AUDIO_DAC_RG_VREF_RAMP_STEP_T_LEN     (3U)
#define AUDIO_DAC_RG_VREF_RAMP_STEP_T_MSK     (((1U << AUDIO_DAC_RG_VREF_RAMP_STEP_T_LEN) - 1) << AUDIO_DAC_RG_VREF_RAMP_STEP_T_POS)
#define AUDIO_DAC_RG_VREF_RAMP_STEP_T_UMSK    (~(((1U << AUDIO_DAC_RG_VREF_RAMP_STEP_T_LEN) - 1) << AUDIO_DAC_RG_VREF_RAMP_STEP_T_POS))
#define AUDIO_DAC_RG_SW_VREF                  AUDIO_DAC_RG_SW_VREF
#define AUDIO_DAC_RG_SW_VREF_POS              (7U)
#define AUDIO_DAC_RG_SW_VREF_LEN              (1U)
#define AUDIO_DAC_RG_SW_VREF_MSK              (((1U << AUDIO_DAC_RG_SW_VREF_LEN) - 1) << AUDIO_DAC_RG_SW_VREF_POS)
#define AUDIO_DAC_RG_SW_VREF_UMSK             (~(((1U << AUDIO_DAC_RG_SW_VREF_LEN) - 1) << AUDIO_DAC_RG_SW_VREF_POS))
#define AUDIO_DAC_RG_VREF_RAMP_DELAY          AUDIO_DAC_RG_VREF_RAMP_DELAY
#define AUDIO_DAC_RG_VREF_RAMP_DELAY_POS      (8U)
#define AUDIO_DAC_RG_VREF_RAMP_DELAY_LEN      (2U)
#define AUDIO_DAC_RG_VREF_RAMP_DELAY_MSK      (((1U << AUDIO_DAC_RG_VREF_RAMP_DELAY_LEN) - 1) << AUDIO_DAC_RG_VREF_RAMP_DELAY_POS)
#define AUDIO_DAC_RG_VREF_RAMP_DELAY_UMSK     (~(((1U << AUDIO_DAC_RG_VREF_RAMP_DELAY_LEN) - 1) << AUDIO_DAC_RG_VREF_RAMP_DELAY_POS))
#define AUDIO_DAC_RG_LO_VREF_RAMP_DVLD        AUDIO_DAC_RG_LO_VREF_RAMP_DVLD
#define AUDIO_DAC_RG_LO_VREF_RAMP_DVLD_POS    (10U)
#define AUDIO_DAC_RG_LO_VREF_RAMP_DVLD_LEN    (1U)
#define AUDIO_DAC_RG_LO_VREF_RAMP_DVLD_MSK    (((1U << AUDIO_DAC_RG_LO_VREF_RAMP_DVLD_LEN) - 1) << AUDIO_DAC_RG_LO_VREF_RAMP_DVLD_POS)
#define AUDIO_DAC_RG_LO_VREF_RAMP_DVLD_UMSK   (~(((1U << AUDIO_DAC_RG_LO_VREF_RAMP_DVLD_LEN) - 1) << AUDIO_DAC_RG_LO_VREF_RAMP_DVLD_POS))
#define AUDIO_DAC_AUTOMUTE_EN                 AUDIO_DAC_AUTOMUTE_EN
#define AUDIO_DAC_AUTOMUTE_EN_POS             (11U)
#define AUDIO_DAC_AUTOMUTE_EN_LEN             (1U)
#define AUDIO_DAC_AUTOMUTE_EN_MSK             (((1U << AUDIO_DAC_AUTOMUTE_EN_LEN) - 1) << AUDIO_DAC_AUTOMUTE_EN_POS)
#define AUDIO_DAC_AUTOMUTE_EN_UMSK            (~(((1U << AUDIO_DAC_AUTOMUTE_EN_LEN) - 1) << AUDIO_DAC_AUTOMUTE_EN_POS))
#define AUDIO_DG_DAC_MUTE                     AUDIO_DG_DAC_MUTE
#define AUDIO_DG_DAC_MUTE_POS                 (12U)
#define AUDIO_DG_DAC_MUTE_LEN                 (1U)
#define AUDIO_DG_DAC_MUTE_MSK                 (((1U << AUDIO_DG_DAC_MUTE_LEN) - 1) << AUDIO_DG_DAC_MUTE_POS)
#define AUDIO_DG_DAC_MUTE_UMSK                (~(((1U << AUDIO_DG_DAC_MUTE_LEN) - 1) << AUDIO_DG_DAC_MUTE_POS))
#define AUDIO_DG_VO_PULLDOWN                  AUDIO_DG_VO_PULLDOWN
#define AUDIO_DG_VO_PULLDOWN_POS              (13U)
#define AUDIO_DG_VO_PULLDOWN_LEN              (1U)
#define AUDIO_DG_VO_PULLDOWN_MSK              (((1U << AUDIO_DG_VO_PULLDOWN_LEN) - 1) << AUDIO_DG_VO_PULLDOWN_POS)
#define AUDIO_DG_VO_PULLDOWN_UMSK             (~(((1U << AUDIO_DG_VO_PULLDOWN_LEN) - 1) << AUDIO_DG_VO_PULLDOWN_POS))
#define AUDIO_DG_PU_VREF_RAMP                 AUDIO_DG_PU_VREF_RAMP
#define AUDIO_DG_PU_VREF_RAMP_POS             (14U)
#define AUDIO_DG_PU_VREF_RAMP_LEN             (1U)
#define AUDIO_DG_PU_VREF_RAMP_MSK             (((1U << AUDIO_DG_PU_VREF_RAMP_LEN) - 1) << AUDIO_DG_PU_VREF_RAMP_POS)
#define AUDIO_DG_PU_VREF_RAMP_UMSK            (~(((1U << AUDIO_DG_PU_VREF_RAMP_LEN) - 1) << AUDIO_DG_PU_VREF_RAMP_POS))
#define AUDIO_DG_VREF_RAMP_STEP               AUDIO_DG_VREF_RAMP_STEP
#define AUDIO_DG_VREF_RAMP_STEP_POS           (15U)
#define AUDIO_DG_VREF_RAMP_STEP_LEN           (12U)
#define AUDIO_DG_VREF_RAMP_STEP_MSK           (((1U << AUDIO_DG_VREF_RAMP_STEP_LEN) - 1) << AUDIO_DG_VREF_RAMP_STEP_POS)
#define AUDIO_DG_VREF_RAMP_STEP_UMSK          (~(((1U << AUDIO_DG_VREF_RAMP_STEP_LEN) - 1) << AUDIO_DG_VREF_RAMP_STEP_POS))
#define AUDIO_DG_SW_VREF                      AUDIO_DG_SW_VREF
#define AUDIO_DG_SW_VREF_POS                  (27U)
#define AUDIO_DG_SW_VREF_LEN                  (1U)
#define AUDIO_DG_SW_VREF_MSK                  (((1U << AUDIO_DG_SW_VREF_LEN) - 1) << AUDIO_DG_SW_VREF_POS)
#define AUDIO_DG_SW_VREF_UMSK                 (~(((1U << AUDIO_DG_SW_VREF_LEN) - 1) << AUDIO_DG_SW_VREF_POS))
#define AUDIO_DG_DACR_EN_LINEOUT              AUDIO_DG_DACR_EN_LINEOUT
#define AUDIO_DG_DACR_EN_LINEOUT_POS          (28U)
#define AUDIO_DG_DACR_EN_LINEOUT_LEN          (1U)
#define AUDIO_DG_DACR_EN_LINEOUT_MSK          (((1U << AUDIO_DG_DACR_EN_LINEOUT_LEN) - 1) << AUDIO_DG_DACR_EN_LINEOUT_POS)
#define AUDIO_DG_DACR_EN_LINEOUT_UMSK         (~(((1U << AUDIO_DG_DACR_EN_LINEOUT_LEN) - 1) << AUDIO_DG_DACR_EN_LINEOUT_POS))
#define AUDIO_DG_DACL_EN_LINEOUT              AUDIO_DG_DACL_EN_LINEOUT
#define AUDIO_DG_DACL_EN_LINEOUT_POS          (29U)
#define AUDIO_DG_DACL_EN_LINEOUT_LEN          (1U)
#define AUDIO_DG_DACL_EN_LINEOUT_MSK          (((1U << AUDIO_DG_DACL_EN_LINEOUT_LEN) - 1) << AUDIO_DG_DACL_EN_LINEOUT_POS)
#define AUDIO_DG_DACL_EN_LINEOUT_UMSK         (~(((1U << AUDIO_DG_DACL_EN_LINEOUT_LEN) - 1) << AUDIO_DG_DACL_EN_LINEOUT_POS))
#define AUDIO_DAC_RG_VREF_RAMP_DCL_MODE       AUDIO_DAC_RG_VREF_RAMP_DCL_MODE
#define AUDIO_DAC_RG_VREF_RAMP_DCL_MODE_POS   (30U)
#define AUDIO_DAC_RG_VREF_RAMP_DCL_MODE_LEN   (2U)
#define AUDIO_DAC_RG_VREF_RAMP_DCL_MODE_MSK   (((1U << AUDIO_DAC_RG_VREF_RAMP_DCL_MODE_LEN) - 1) << AUDIO_DAC_RG_VREF_RAMP_DCL_MODE_POS)
#define AUDIO_DAC_RG_VREF_RAMP_DCL_MODE_UMSK  (~(((1U << AUDIO_DAC_RG_VREF_RAMP_DCL_MODE_LEN) - 1) << AUDIO_DAC_RG_VREF_RAMP_DCL_MODE_POS))

