bouffalolab/bouffalo_sdk/components/multimedia/xcodec/src/bl606p/drv/msp_audio_reg.h
/* 0x804 : padc_ana_cfg2 */
#define AUDIO_PADC_ANA_CFG2_OFFSET    (0x804)
#define AUDIO_PADC_SDM_CHOP_PHAS      AUDIO_PADC_SDM_CHOP_PHAS
#define AUDIO_PADC_SDM_CHOP_PHAS_POS  (0U)
#define AUDIO_PADC_SDM_CHOP_PHAS_LEN  (1U)
#define AUDIO_PADC_SDM_CHOP_PHAS_MSK  (((1U << AUDIO_PADC_SDM_CHOP_PHAS_LEN) - 1) << AUDIO_PADC_SDM_CHOP_PHAS_POS)
#define AUDIO_PADC_SDM_CHOP_PHAS_UMSK (~(((1U << AUDIO_PADC_SDM_CHOP_PHAS_LEN) - 1) << AUDIO_PADC_SDM_CHOP_PHAS_POS))
#define AUDIO_PADC_SDM_CHOP_FREQ      AUDIO_PADC_SDM_CHOP_FREQ
#define AUDIO_PADC_SDM_CHOP_FREQ_POS  (1U)
#define AUDIO_PADC_SDM_CHOP_FREQ_LEN  (3U)
#define AUDIO_PADC_SDM_CHOP_FREQ_MSK  (((1U << AUDIO_PADC_SDM_CHOP_FREQ_LEN) - 1) << AUDIO_PADC_SDM_CHOP_FREQ_POS)
#define AUDIO_PADC_SDM_CHOP_FREQ_UMSK (~(((1U << AUDIO_PADC_SDM_CHOP_FREQ_LEN) - 1) << AUDIO_PADC_SDM_CHOP_FREQ_POS))
#define AUDIO_PADC_SDM_CHOP_EN        AUDIO_PADC_SDM_CHOP_EN
#define AUDIO_PADC_SDM_CHOP_EN_POS    (4U)
#define AUDIO_PADC_SDM_CHOP_EN_LEN    (1U)
#define AUDIO_PADC_SDM_CHOP_EN_MSK    (((1U << AUDIO_PADC_SDM_CHOP_EN_LEN) - 1) << AUDIO_PADC_SDM_CHOP_EN_POS)
#define AUDIO_PADC_SDM_CHOP_EN_UMSK   (~(((1U << AUDIO_PADC_SDM_CHOP_EN_LEN) - 1) << AUDIO_PADC_SDM_CHOP_EN_POS))
#define AUDIO_PADC_DITHER_ORDER       AUDIO_PADC_DITHER_ORDER
#define AUDIO_PADC_DITHER_ORDER_POS   (5U)
#define AUDIO_PADC_DITHER_ORDER_LEN   (1U)
#define AUDIO_PADC_DITHER_ORDER_MSK   (((1U << AUDIO_PADC_DITHER_ORDER_LEN) - 1) << AUDIO_PADC_DITHER_ORDER_POS)
#define AUDIO_PADC_DITHER_ORDER_UMSK  (~(((1U << AUDIO_PADC_DITHER_ORDER_LEN) - 1) << AUDIO_PADC_DITHER_ORDER_POS))
#define AUDIO_PADC_DITHER_SEL         AUDIO_PADC_DITHER_SEL
#define AUDIO_PADC_DITHER_SEL_POS     (6U)
#define AUDIO_PADC_DITHER_SEL_LEN     (2U)
#define AUDIO_PADC_DITHER_SEL_MSK     (((1U << AUDIO_PADC_DITHER_SEL_LEN) - 1) << AUDIO_PADC_DITHER_SEL_POS)
#define AUDIO_PADC_DITHER_SEL_UMSK    (~(((1U << AUDIO_PADC_DITHER_SEL_LEN) - 1) << AUDIO_PADC_DITHER_SEL_POS))
#define AUDIO_PADC_QUAN_GAIN          AUDIO_PADC_QUAN_GAIN
#define AUDIO_PADC_QUAN_GAIN_POS      (8U)
#define AUDIO_PADC_QUAN_GAIN_LEN      (2U)
#define AUDIO_PADC_QUAN_GAIN_MSK      (((1U << AUDIO_PADC_QUAN_GAIN_LEN) - 1) << AUDIO_PADC_QUAN_GAIN_POS)
#define AUDIO_PADC_QUAN_GAIN_UMSK     (~(((1U << AUDIO_PADC_QUAN_GAIN_LEN) - 1) << AUDIO_PADC_QUAN_GAIN_POS))
#define AUDIO_PADC_DEM_EN             AUDIO_PADC_DEM_EN
#define AUDIO_PADC_DEM_EN_POS         (10U)
#define AUDIO_PADC_DEM_EN_LEN         (1U)
#define AUDIO_PADC_DEM_EN_MSK         (((1U << AUDIO_PADC_DEM_EN_LEN) - 1) << AUDIO_PADC_DEM_EN_POS)
#define AUDIO_PADC_DEM_EN_UMSK        (~(((1U << AUDIO_PADC_DEM_EN_LEN) - 1) << AUDIO_PADC_DEM_EN_POS))
#define AUDIO_PADC_NCTRL_ADC2         AUDIO_PADC_NCTRL_ADC2
#define AUDIO_PADC_NCTRL_ADC2_POS     (11U)
#define AUDIO_PADC_NCTRL_ADC2_LEN     (1U)
#define AUDIO_PADC_NCTRL_ADC2_MSK     (((1U << AUDIO_PADC_NCTRL_ADC2_LEN) - 1) << AUDIO_PADC_NCTRL_ADC2_POS)
#define AUDIO_PADC_NCTRL_ADC2_UMSK    (~(((1U << AUDIO_PADC_NCTRL_ADC2_LEN) - 1) << AUDIO_PADC_NCTRL_ADC2_POS))
#define AUDIO_PADC_NCTRL_ADC1         AUDIO_PADC_NCTRL_ADC1
#define AUDIO_PADC_NCTRL_ADC1_POS     (13U)
#define AUDIO_PADC_NCTRL_ADC1_LEN     (2U)
#define AUDIO_PADC_NCTRL_ADC1_MSK     (((1U << AUDIO_PADC_NCTRL_ADC1_LEN) - 1) << AUDIO_PADC_NCTRL_ADC1_POS)
#define AUDIO_PADC_NCTRL_ADC1_UMSK    (~(((1U << AUDIO_PADC_NCTRL_ADC1_LEN) - 1) << AUDIO_PADC_NCTRL_ADC1_POS))
#define AUDIO_PADC_ICTRL_ADC          AUDIO_PADC_ICTRL_ADC
#define AUDIO_PADC_ICTRL_ADC_POS      (15U)
#define AUDIO_PADC_ICTRL_ADC_LEN      (2U)
#define AUDIO_PADC_ICTRL_ADC_MSK      (((1U << AUDIO_PADC_ICTRL_ADC_LEN) - 1) << AUDIO_PADC_ICTRL_ADC_POS)
#define AUDIO_PADC_ICTRL_ADC_UMSK     (~(((1U << AUDIO_PADC_ICTRL_ADC_LEN) - 1) << AUDIO_PADC_ICTRL_ADC_POS))
#define AUDIO_PADC_RESERVED           AUDIO_PADC_RESERVED
#define AUDIO_PADC_RESERVED_POS       (17U)
#define AUDIO_PADC_RESERVED_LEN       (4U)
#define AUDIO_PADC_RESERVED_MSK       (((1U << AUDIO_PADC_RESERVED_LEN) - 1) << AUDIO_PADC_RESERVED_POS)
#define AUDIO_PADC_RESERVED_UMSK      (~(((1U << AUDIO_PADC_RESERVED_LEN) - 1) << AUDIO_PADC_RESERVED_POS))

/* 0x808 : padc_ana_cmd */
#define AUDIO_PADC_ANA_CMD_OFFSET    (0x808)
#define AUDIO_PADC_SELF_TEST_EN      AUDIO_PADC_SELF_TEST_EN
#define AUDIO_PADC_SELF_TEST_EN_POS  (2U)
#define AUDIO_PADC_SELF_TEST_EN_LEN  (1U)
#define AUDIO_PADC_SELF_TEST_EN_MSK  (((1U << AUDIO_PADC_SELF_TEST_EN_LEN) - 1) << AUDIO_PADC_SELF_TEST_EN_POS)
#define AUDIO_PADC_SELF_TEST_EN_UMSK (~(((1U << AUDIO_PADC_SELF_TEST_EN_LEN) - 1) << AUDIO_PADC_SELF_TEST_EN_POS))
#define AUDIO_PADC_SDM_LP_EN         AUDIO_PADC_SDM_LP_EN
#define AUDIO_PADC_SDM_LP_EN_POS     (3U)
#define AUDIO_PADC_SDM_LP_EN_LEN     (1U)
#define AUDIO_PADC_SDM_LP_EN_MSK     (((1U << AUDIO_PADC_SDM_LP_EN_LEN) - 1) << AUDIO_PADC_SDM_LP_EN_POS)
#define AUDIO_PADC_SDM_LP_EN_UMSK    (~(((1U << AUDIO_PADC_SDM_LP_EN_LEN) - 1) << AUDIO_PADC_SDM_LP_EN_POS))
#define AUDIO_PADC_PGA_LP_EN         AUDIO_PADC_PGA_LP_EN
#define AUDIO_PADC_PGA_LP_EN_POS     (4U)
#define AUDIO_PADC_PGA_LP_EN_LEN     (1U)
#define AUDIO_PADC_PGA_LP_EN_MSK     (((1U << AUDIO_PADC_PGA_LP_EN_LEN) - 1) << AUDIO_PADC_PGA_LP_EN_POS)
#define AUDIO_PADC_PGA_LP_EN_UMSK    (~(((1U << AUDIO_PADC_PGA_LP_EN_LEN) - 1) << AUDIO_PADC_PGA_LP_EN_POS))
#define AUDIO_PADC_DIAG_GSW          AUDIO_PADC_DIAG_GSW
#define AUDIO_PADC_DIAG_GSW_POS      (5U)
#define AUDIO_PADC_DIAG_GSW_LEN      (2U)
#define AUDIO_PADC_DIAG_GSW_MSK      (((1U << AUDIO_PADC_DIAG_GSW_LEN) - 1) << AUDIO_PADC_DIAG_GSW_POS)
#define AUDIO_PADC_DIAG_GSW_UMSK     (~(((1U << AUDIO_PADC_DIAG_GSW_LEN) - 1) << AUDIO_PADC_DIAG_GSW_POS))
#define AUDIO_PADC_DIAG_PSW          AUDIO_PADC_DIAG_PSW
#define AUDIO_PADC_DIAG_PSW_POS      (7U)
#define AUDIO_PADC_DIAG_PSW_LEN      (2U)
#define AUDIO_PADC_DIAG_PSW_MSK      (((1U << AUDIO_PADC_DIAG_PSW_LEN) - 1) << AUDIO_PADC_DIAG_PSW_POS)
#define AUDIO_PADC_DIAG_PSW_UMSK     (~(((1U << AUDIO_PADC_DIAG_PSW_LEN) - 1) << AUDIO_PADC_DIAG_PSW_POS))
#define AUDIO_PADC_ICTRL_DIAG        AUDIO_PADC_ICTRL_DIAG
#define AUDIO_PADC_ICTRL_DIAG_POS    (9U)
#define AUDIO_PADC_ICTRL_DIAG_LEN    (2U)
#define AUDIO_PADC_ICTRL_DIAG_MSK    (((1U << AUDIO_PADC_ICTRL_DIAG_LEN) - 1) << AUDIO_PADC_ICTRL_DIAG_POS)
#define AUDIO_PADC_ICTRL_DIAG_UMSK   (~(((1U << AUDIO_PADC_ICTRL_DIAG_LEN) - 1) << AUDIO_PADC_ICTRL_DIAG_POS))
#define AUDIO_PADC_PGA_GAIN          AUDIO_PADC_PGA_GAIN
#define AUDIO_PADC_PGA_GAIN_POS      (11U)
#define AUDIO_PADC_PGA_GAIN_LEN      (3U)
#define AUDIO_PADC_PGA_GAIN_MSK      (((1U << AUDIO_PADC_PGA_GAIN_LEN) - 1) << AUDIO_PADC_PGA_GAIN_POS)
#define AUDIO_PADC_PGA_GAIN_UMSK     (~(((1U << AUDIO_PADC_PGA_GAIN_LEN) - 1) << AUDIO_PADC_PGA_GAIN_POS))
#define AUDIO_PADC_INV_SIG           AUDIO_PADC_INV_SIG
#define AUDIO_PADC_INV_SIG_POS       (14U)
#define AUDIO_PADC_INV_SIG_LEN       (1U)
#define AUDIO_PADC_INV_SIG_MSK       (((1U << AUDIO_PADC_INV_SIG_LEN) - 1) << AUDIO_PADC_INV_SIG_POS)
#define AUDIO_PADC_INV_SIG_UMSK      (~(((1U << AUDIO_PADC_INV_SIG_LEN) - 1) << AUDIO_PADC_INV_SIG_POS))
#define AUDIO_PADC_SINGLE_MODE       AUDIO_PADC_SINGLE_MODE
#define AUDIO_PADC_SINGLE_MODE_POS   (15U)
#define AUDIO_PADC_SINGLE_MODE_LEN   (2U)
#define AUDIO_PADC_SINGLE_MODE_MSK   (((1U << AUDIO_PADC_SINGLE_MODE_LEN) - 1) << AUDIO_PADC_SINGLE_MODE_POS)
#define AUDIO_PADC_SINGLE_MODE_UMSK  (~(((1U << AUDIO_PADC_SINGLE_MODE_LEN) - 1) << AUDIO_PADC_SINGLE_MODE_POS))
#define AUDIO_PADC_SINGLE_CFG        AUDIO_PADC_SINGLE_CFG
#define AUDIO_PADC_SINGLE_CFG_POS    (17U)
#define AUDIO_PADC_SINGLE_CFG_LEN    (4U)
#define AUDIO_PADC_SINGLE_CFG_MSK    (((1U << AUDIO_PADC_SINGLE_CFG_LEN) - 1) << AUDIO_PADC_SINGLE_CFG_POS)
#define AUDIO_PADC_SINGLE_CFG_UMSK   (~(((1U << AUDIO_PADC_SINGLE_CFG_LEN) - 1) << AUDIO_PADC_SINGLE_CFG_POS))
#define AUDIO_PADC_CHANNEL_SEL       AUDIO_PADC_CHANNEL_SEL
#define AUDIO_PADC_CHANNEL_SEL_POS   (21U)
#define AUDIO_PADC_CHANNEL_SEL_LEN   (2U)
#define AUDIO_PADC_CHANNEL_SEL_MSK   (((1U << AUDIO_PADC_CHANNEL_SEL_LEN) - 1) << AUDIO_PADC_CHANNEL_SEL_POS)
#define AUDIO_PADC_CHANNEL_SEL_UMSK  (~(((1U << AUDIO_PADC_CHANNEL_SEL_LEN) - 1) << AUDIO_PADC_CHANNEL_SEL_POS))
#define AUDIO_PADC_CHANNEL_EN        AUDIO_PADC_CHANNEL_EN
#define AUDIO_PADC_CHANNEL_EN_POS    (23U)
#define AUDIO_PADC_CHANNEL_EN_LEN    (1U)
#define AUDIO_PADC_CHANNEL_EN_MSK    (((1U << AUDIO_PADC_CHANNEL_EN_LEN) - 1) << AUDIO_PADC_CHANNEL_EN_POS)
#define AUDIO_PADC_CHANNEL_EN_UMSK   (~(((1U << AUDIO_PADC_CHANNEL_EN_LEN) - 1) << AUDIO_PADC_CHANNEL_EN_POS))
#define AUDIO_PADC_CONV_DELAY        AUDIO_PADC_CONV_DELAY
#define AUDIO_PADC_CONV_DELAY_POS    (24U)
#define AUDIO_PADC_CONV_DELAY_LEN    (4U)
#define AUDIO_PADC_CONV_DELAY_MSK    (((1U << AUDIO_PADC_CONV_DELAY_LEN) - 1) << AUDIO_PADC_CONV_DELAY_POS)
#define AUDIO_PADC_CONV_DELAY_UMSK   (~(((1U << AUDIO_PADC_CONV_DELAY_LEN) - 1) << AUDIO_PADC_CONV_DELAY_POS))
#define AUDIO_PADC_CONV              AUDIO_PADC_CONV
#define AUDIO_PADC_CONV_POS          (28U)
#define AUDIO_PADC_CONV_LEN          (1U)
#define AUDIO_PADC_CONV_MSK          (((1U << AUDIO_PADC_CONV_LEN) - 1) << AUDIO_PADC_CONV_POS)
#define AUDIO_PADC_CONV_UMSK         (~(((1U << AUDIO_PADC_CONV_LEN) - 1) << AUDIO_PADC_CONV_POS))
#define AUDIO_PADC_EN_CALDAC         AUDIO_PADC_EN_CALDAC
#define AUDIO_PADC_EN_CALDAC_POS     (29U)
#define AUDIO_PADC_EN_CALDAC_LEN     (1U)
#define AUDIO_PADC_EN_CALDAC_MSK     (((1U << AUDIO_PADC_EN_CALDAC_LEN) - 1) << AUDIO_PADC_EN_CALDAC_POS)
#define AUDIO_PADC_EN_CALDAC_UMSK    (~(((1U << AUDIO_PADC_EN_CALDAC_LEN) - 1) << AUDIO_PADC_EN_CALDAC_POS))
#define AUDIO_PADC_SDM_PU            AUDIO_PADC_SDM_PU
#define AUDIO_PADC_SDM_PU_POS        (30U)
#define AUDIO_PADC_SDM_PU_LEN        (1U)
#define AUDIO_PADC_SDM_PU_MSK        (((1U << AUDIO_PADC_SDM_PU_LEN) - 1) << AUDIO_PADC_SDM_PU_POS)
#define AUDIO_PADC_SDM_PU_UMSK       (~(((1U << AUDIO_PADC_SDM_PU_LEN) - 1) << AUDIO_PADC_SDM_PU_POS))
#define AUDIO_PADC_PGA_PU            AUDIO_PADC_PGA_PU
#define AUDIO_PADC_PGA_PU_POS        (31U)
#define AUDIO_PADC_PGA_PU_LEN        (1U)
#define AUDIO_PADC_PGA_PU_MSK        (((1U << AUDIO_PADC_PGA_PU_LEN) - 1) << AUDIO_PADC_PGA_PU_POS)
#define AUDIO_PADC_PGA_PU_UMSK       (~(((1U << AUDIO_PADC_PGA_PU_LEN) - 1) << AUDIO_PADC_PGA_PU_POS))

/* 0x80C : padc_out_cfg */
#define AUDIO_PADC_OUT_CFG_OFFSET      (0x80C)
#define AUDIO_PADC_VALID_4S_VAL        AUDIO_PADC_VALID_4S_VAL
#define AUDIO_PADC_VALID_4S_VAL_POS    (21U)
#define AUDIO_PADC_VALID_4S_VAL_LEN    (1U)
#define AUDIO_PADC_VALID_4S_VAL_MSK    (((1U << AUDIO_PADC_VALID_4S_VAL_LEN) - 1) << AUDIO_PADC_VALID_4S_VAL_POS)
#define AUDIO_PADC_VALID_4S_VAL_UMSK   (~(((1U << AUDIO_PADC_VALID_4S_VAL_LEN) - 1) << AUDIO_PADC_VALID_4S_VAL_POS))
#define AUDIO_PADC_VALID_4S_EN         AUDIO_PADC_VALID_4S_EN
#define AUDIO_PADC_VALID_4S_EN_POS     (22U)
#define AUDIO_PADC_VALID_4S_EN_LEN     (1U)
#define AUDIO_PADC_VALID_4S_EN_MSK     (((1U << AUDIO_PADC_VALID_4S_EN_LEN) - 1) << AUDIO_PADC_VALID_4S_EN_POS)
#define AUDIO_PADC_VALID_4S_EN_UMSK    (~(((1U << AUDIO_PADC_VALID_4S_EN_LEN) - 1) << AUDIO_PADC_VALID_4S_EN_POS))
#define AUDIO_PADC_GLOBAL_CHOP_EN      AUDIO_PADC_GLOBAL_CHOP_EN
#define AUDIO_PADC_GLOBAL_CHOP_EN_POS  (23U)
#define AUDIO_PADC_GLOBAL_CHOP_EN_LEN  (1U)
#define AUDIO_PADC_GLOBAL_CHOP_EN_MSK  (((1U << AUDIO_PADC_GLOBAL_CHOP_EN_LEN) - 1) << AUDIO_PADC_GLOBAL_CHOP_EN_POS)
#define AUDIO_PADC_GLOBAL_CHOP_EN_UMSK (~(((1U << AUDIO_PADC_GLOBAL_CHOP_EN_LEN) - 1) << AUDIO_PADC_GLOBAL_CHOP_EN_POS))
#define AUDIO_PADC_FILTER_TYPE         AUDIO_PADC_FILTER_TYPE
#define AUDIO_PADC_FILTER_TYPE_POS     (24U)
#define AUDIO_PADC_FILTER_TYPE_LEN     (1U)
#define AUDIO_PADC_FILTER_TYPE_MSK     (((1U << AUDIO_PADC_FILTER_TYPE_LEN) - 1) << AUDIO_PADC_FILTER_TYPE_POS)
#define AUDIO_PADC_FILTER_TYPE_UMSK    (~(((1U << AUDIO_PADC_FILTER_TYPE_LEN) - 1) << AUDIO_PADC_FILTER_TYPE_POS))
#define AUDIO_PADC_ODR                 AUDIO_PADC_ODR
#define AUDIO_PADC_ODR_POS             (25U)
#define AUDIO_PADC_ODR_LEN             (4U)
#define AUDIO_PADC_ODR_MSK             (((1U << AUDIO_PADC_ODR_LEN) - 1) << AUDIO_PADC_ODR_POS)
#define AUDIO_PADC_ODR_UMSK            (~(((1U << AUDIO_PADC_ODR_LEN) - 1) << AUDIO_PADC_ODR_POS))

/* 0x810 : padc_calib_cmd */
#define AUDIO_PADC_CALIB_CMD_OFFSET   (0x810)
#define AUDIO_PADC_CALIB_AVERAGE      AUDIO_PADC_CALIB_AVERAGE
#define AUDIO_PADC_CALIB_AVERAGE_POS  (16U)
#define AUDIO_PADC_CALIB_AVERAGE_LEN  (3U)
#define AUDIO_PADC_CALIB_AVERAGE_MSK  (((1U << AUDIO_PADC_CALIB_AVERAGE_LEN) - 1) << AUDIO_PADC_CALIB_AVERAGE_POS)
#define AUDIO_PADC_CALIB_AVERAGE_UMSK (~(((1U << AUDIO_PADC_CALIB_AVERAGE_LEN) - 1) << AUDIO_PADC_CALIB_AVERAGE_POS))
#define AUDIO_PADC_CALIB_DISCARD      AUDIO_PADC_CALIB_DISCARD
#define AUDIO_PADC_CALIB_DISCARD_POS  (19U)
#define AUDIO_PADC_CALIB_DISCARD_LEN  (3U)
#define AUDIO_PADC_CALIB_DISCARD_MSK  (((1U << AUDIO_PADC_CALIB_DISCARD_LEN) - 1) << AUDIO_PADC_CALIB_DISCARD_POS)
#define AUDIO_PADC_CALIB_DISCARD_UMSK (~(((1U << AUDIO_PADC_CALIB_DISCARD_LEN) - 1) << AUDIO_PADC_CALIB_DISCARD_POS))
#define AUDIO_PADC_CALIB_RUN          AUDIO_PADC_CALIB_RUN
#define AUDIO_PADC_CALIB_RUN_POS      (22U)
#define AUDIO_PADC_CALIB_RUN_LEN      (1U)
#define AUDIO_PADC_CALIB_RUN_MSK      (((1U << AUDIO_PADC_CALIB_RUN_LEN) - 1) << AUDIO_PADC_CALIB_RUN_POS)
#define AUDIO_PADC_CALIB_RUN_UMSK     (~(((1U << AUDIO_PADC_CALIB_RUN_LEN) - 1) << AUDIO_PADC_CALIB_RUN_POS))
#define AUDIO_PADC_CALIB_LVL          AUDIO_PADC_CALIB_LVL
#define AUDIO_PADC_CALIB_LVL_POS      (23U)
#define AUDIO_PADC_CALIB_LVL_LEN      (2U)
#define AUDIO_PADC_CALIB_LVL_MSK      (((1U << AUDIO_PADC_CALIB_LVL_LEN) - 1) << AUDIO_PADC_CALIB_LVL_POS)
#define AUDIO_PADC_CALIB_LVL_UMSK     (~(((1U << AUDIO_PADC_CALIB_LVL_LEN) - 1) << AUDIO_PADC_CALIB_LVL_POS))
#define AUDIO_PADC_CALIB_GAIN         AUDIO_PADC_CALIB_GAIN
#define AUDIO_PADC_CALIB_GAIN_POS     (25U)
#define AUDIO_PADC_CALIB_GAIN_LEN     (3U)
#define AUDIO_PADC_CALIB_GAIN_MSK     (((1U << AUDIO_PADC_CALIB_GAIN_LEN) - 1) << AUDIO_PADC_CALIB_GAIN_POS)
#define AUDIO_PADC_CALIB_GAIN_UMSK    (~(((1U << AUDIO_PADC_CALIB_GAIN_LEN) - 1) << AUDIO_PADC_CALIB_GAIN_POS))
#define AUDIO_PADC_CALIB_MODE         AUDIO_PADC_CALIB_MODE
#define AUDIO_PADC_CALIB_MODE_POS     (28U)
#define AUDIO_PADC_CALIB_MODE_LEN     (2U)
#define AUDIO_PADC_CALIB_MODE_MSK     (((1U << AUDIO_PADC_CALIB_MODE_LEN) - 1) << AUDIO_PADC_CALIB_MODE_POS)
#define AUDIO_PADC_CALIB_MODE_UMSK    (~(((1U << AUDIO_PADC_CALIB_MODE_LEN) - 1) << AUDIO_PADC_CALIB_MODE_POS))
#define AUDIO_PADC_CALIB_START        AUDIO_PADC_CALIB_START
#define AUDIO_PADC_CALIB_START_POS    (30U)
#define AUDIO_PADC_CALIB_START_LEN    (1U)
#define AUDIO_PADC_CALIB_START_MSK    (((1U << AUDIO_PADC_CALIB_START_LEN) - 1) << AUDIO_PADC_CALIB_START_POS)
#define AUDIO_PADC_CALIB_START_UMSK   (~(((1U << AUDIO_PADC_CALIB_START_LEN) - 1) << AUDIO_PADC_CALIB_START_POS))
#define AUDIO_PADC_CALIB_METHOD       AUDIO_PADC_CALIB_METHOD
#define AUDIO_PADC_CALIB_METHOD_POS   (31U)
#define AUDIO_PADC_CALIB_METHOD_LEN   (1U)
#define AUDIO_PADC_CALIB_METHOD_MSK   (((1U << AUDIO_PADC_CALIB_METHOD_LEN) - 1) << AUDIO_PADC_CALIB_METHOD_POS)
#define AUDIO_PADC_CALIB_METHOD_UMSK  (~(((1U << AUDIO_PADC_CALIB_METHOD_LEN) - 1) << AUDIO_PADC_CALIB_METHOD_POS))

