bouffalolab/bouffalo_sdk/components/multimedia/xcodec/src/bl606p/drv/msp_audio_reg.h
/* 0x814 : padc_status */
#define AUDIO_PADC_STATUS_OFFSET   (0x814)
#define AUDIO_PADC_SOFT_RST        AUDIO_PADC_SOFT_RST
#define AUDIO_PADC_SOFT_RST_POS    (2U)
#define AUDIO_PADC_SOFT_RST_LEN    (1U)
#define AUDIO_PADC_SOFT_RST_MSK    (((1U << AUDIO_PADC_SOFT_RST_LEN) - 1) << AUDIO_PADC_SOFT_RST_POS)
#define AUDIO_PADC_SOFT_RST_UMSK   (~(((1U << AUDIO_PADC_SOFT_RST_LEN) - 1) << AUDIO_PADC_SOFT_RST_POS))
#define AUDIO_PADC_FILTER_RDY      AUDIO_PADC_FILTER_RDY
#define AUDIO_PADC_FILTER_RDY_POS  (3U)
#define AUDIO_PADC_FILTER_RDY_LEN  (1U)
#define AUDIO_PADC_FILTER_RDY_MSK  (((1U << AUDIO_PADC_FILTER_RDY_LEN) - 1) << AUDIO_PADC_FILTER_RDY_POS)
#define AUDIO_PADC_FILTER_RDY_UMSK (~(((1U << AUDIO_PADC_FILTER_RDY_LEN) - 1) << AUDIO_PADC_FILTER_RDY_POS))
#define AUDIO_PADC_CALIB_ST        AUDIO_PADC_CALIB_ST
#define AUDIO_PADC_CALIB_ST_POS    (24U)
#define AUDIO_PADC_CALIB_ST_LEN    (3U)
#define AUDIO_PADC_CALIB_ST_MSK    (((1U << AUDIO_PADC_CALIB_ST_LEN) - 1) << AUDIO_PADC_CALIB_ST_POS)
#define AUDIO_PADC_CALIB_ST_UMSK   (~(((1U << AUDIO_PADC_CALIB_ST_LEN) - 1) << AUDIO_PADC_CALIB_ST_POS))
#define AUDIO_PADC_CALIB_BUSY      AUDIO_PADC_CALIB_BUSY
#define AUDIO_PADC_CALIB_BUSY_POS  (27U)
#define AUDIO_PADC_CALIB_BUSY_LEN  (1U)
#define AUDIO_PADC_CALIB_BUSY_MSK  (((1U << AUDIO_PADC_CALIB_BUSY_LEN) - 1) << AUDIO_PADC_CALIB_BUSY_POS)
#define AUDIO_PADC_CALIB_BUSY_UMSK (~(((1U << AUDIO_PADC_CALIB_BUSY_LEN) - 1) << AUDIO_PADC_CALIB_BUSY_POS))
#define AUDIO_PADC_INT             AUDIO_PADC_INT
#define AUDIO_PADC_INT_POS         (28U)
#define AUDIO_PADC_INT_LEN         (1U)
#define AUDIO_PADC_INT_MSK         (((1U << AUDIO_PADC_INT_LEN) - 1) << AUDIO_PADC_INT_POS)
#define AUDIO_PADC_INT_UMSK        (~(((1U << AUDIO_PADC_INT_LEN) - 1) << AUDIO_PADC_INT_POS))
#define AUDIO_PADC_INT_CLR         AUDIO_PADC_INT_CLR
#define AUDIO_PADC_INT_CLR_POS     (29U)
#define AUDIO_PADC_INT_CLR_LEN     (1U)
#define AUDIO_PADC_INT_CLR_MSK     (((1U << AUDIO_PADC_INT_CLR_LEN) - 1) << AUDIO_PADC_INT_CLR_POS)
#define AUDIO_PADC_INT_CLR_UMSK    (~(((1U << AUDIO_PADC_INT_CLR_LEN) - 1) << AUDIO_PADC_INT_CLR_POS))
#define AUDIO_PADC_INT_SET         AUDIO_PADC_INT_SET
#define AUDIO_PADC_INT_SET_POS     (30U)
#define AUDIO_PADC_INT_SET_LEN     (1U)
#define AUDIO_PADC_INT_SET_MSK     (((1U << AUDIO_PADC_INT_SET_LEN) - 1) << AUDIO_PADC_INT_SET_POS)
#define AUDIO_PADC_INT_SET_UMSK    (~(((1U << AUDIO_PADC_INT_SET_LEN) - 1) << AUDIO_PADC_INT_SET_POS))

/* 0x818 : padc_data */
#define AUDIO_PADC_DATA_OFFSET   (0x818)
#define AUDIO_PADC_RAW_DATA      AUDIO_PADC_RAW_DATA
#define AUDIO_PADC_RAW_DATA_POS  (0U)
#define AUDIO_PADC_RAW_DATA_LEN  (24U)
#define AUDIO_PADC_RAW_DATA_MSK  (((1U << AUDIO_PADC_RAW_DATA_LEN) - 1) << AUDIO_PADC_RAW_DATA_POS)
#define AUDIO_PADC_RAW_DATA_UMSK (~(((1U << AUDIO_PADC_RAW_DATA_LEN) - 1) << AUDIO_PADC_RAW_DATA_POS))

/* 0x81C : padc_calib_cfg1 */
#define AUDIO_PADC_CALIB_CFG1_OFFSET (0x81C)
#define AUDIO_PADC_OEC               AUDIO_PADC_OEC
#define AUDIO_PADC_OEC_POS           (0U)
#define AUDIO_PADC_OEC_LEN           (24U)
#define AUDIO_PADC_OEC_MSK           (((1U << AUDIO_PADC_OEC_LEN) - 1) << AUDIO_PADC_OEC_POS)
#define AUDIO_PADC_OEC_UMSK          (~(((1U << AUDIO_PADC_OEC_LEN) - 1) << AUDIO_PADC_OEC_POS))

/* 0x820 : padc_calib_cfg2 */
#define AUDIO_PADC_CALIB_CFG2_OFFSET (0x820)
#define AUDIO_PADC_GEC               AUDIO_PADC_GEC
#define AUDIO_PADC_GEC_POS           (0U)
#define AUDIO_PADC_GEC_LEN           (24U)
#define AUDIO_PADC_GEC_MSK           (((1U << AUDIO_PADC_GEC_LEN) - 1) << AUDIO_PADC_GEC_POS)
#define AUDIO_PADC_GEC_UMSK          (~(((1U << AUDIO_PADC_GEC_LEN) - 1) << AUDIO_PADC_GEC_POS))

/* 0x824 : padc_calib_cfg3 */
#define AUDIO_PADC_CALIB_CFG3_OFFSET (0x824)

/* 0x828 : padc_calib_cfg4 */
#define AUDIO_PADC_CALIB_CFG4_OFFSET (0x828)

/* 0x82C : padc_calib_cfg5 */
#define AUDIO_PADC_CALIB_CFG5_OFFSET (0x82C)
#define AUDIO_PADC_GAINCAL_REF       AUDIO_PADC_GAINCAL_REF
#define AUDIO_PADC_GAINCAL_REF_POS   (0U)
#define AUDIO_PADC_GAINCAL_REF_LEN   (24U)
#define AUDIO_PADC_GAINCAL_REF_MSK   (((1U << AUDIO_PADC_GAINCAL_REF_LEN) - 1) << AUDIO_PADC_GAINCAL_REF_POS)
#define AUDIO_PADC_GAINCAL_REF_UMSK  (~(((1U << AUDIO_PADC_GAINCAL_REF_LEN) - 1) << AUDIO_PADC_GAINCAL_REF_POS))

/* 0x830 : padc_calib_cfg6 */
#define AUDIO_PADC_CALIB_CFG6_OFFSET (0x830)

/* 0x834 : padc_calib_cfg7 */
#define AUDIO_PADC_CALIB_CFG7_OFFSET (0x834)

/* 0x838 : padc_oec_w1p */
#define AUDIO_PADC_OEC_W1P_OFFSET  (0x838)
#define AUDIO_PADC_WR_OEC          AUDIO_PADC_WR_OEC
#define AUDIO_PADC_WR_OEC_POS      (0U)
#define AUDIO_PADC_WR_OEC_LEN      (24U)
#define AUDIO_PADC_WR_OEC_MSK      (((1U << AUDIO_PADC_WR_OEC_LEN) - 1) << AUDIO_PADC_WR_OEC_POS)
#define AUDIO_PADC_WR_OEC_UMSK     (~(((1U << AUDIO_PADC_WR_OEC_LEN) - 1) << AUDIO_PADC_WR_OEC_POS))
#define AUDIO_PADC_OEC_W1P_G0      AUDIO_PADC_OEC_W1P_G0
#define AUDIO_PADC_OEC_W1P_G0_POS  (24U)
#define AUDIO_PADC_OEC_W1P_G0_LEN  (1U)
#define AUDIO_PADC_OEC_W1P_G0_MSK  (((1U << AUDIO_PADC_OEC_W1P_G0_LEN) - 1) << AUDIO_PADC_OEC_W1P_G0_POS)
#define AUDIO_PADC_OEC_W1P_G0_UMSK (~(((1U << AUDIO_PADC_OEC_W1P_G0_LEN) - 1) << AUDIO_PADC_OEC_W1P_G0_POS))
#define AUDIO_PADC_OEC_W1P_G1      AUDIO_PADC_OEC_W1P_G1
#define AUDIO_PADC_OEC_W1P_G1_POS  (25U)
#define AUDIO_PADC_OEC_W1P_G1_LEN  (1U)
#define AUDIO_PADC_OEC_W1P_G1_MSK  (((1U << AUDIO_PADC_OEC_W1P_G1_LEN) - 1) << AUDIO_PADC_OEC_W1P_G1_POS)
#define AUDIO_PADC_OEC_W1P_G1_UMSK (~(((1U << AUDIO_PADC_OEC_W1P_G1_LEN) - 1) << AUDIO_PADC_OEC_W1P_G1_POS))
#define AUDIO_PADC_OEC_W1P_G2      AUDIO_PADC_OEC_W1P_G2
#define AUDIO_PADC_OEC_W1P_G2_POS  (26U)
#define AUDIO_PADC_OEC_W1P_G2_LEN  (1U)
#define AUDIO_PADC_OEC_W1P_G2_MSK  (((1U << AUDIO_PADC_OEC_W1P_G2_LEN) - 1) << AUDIO_PADC_OEC_W1P_G2_POS)
#define AUDIO_PADC_OEC_W1P_G2_UMSK (~(((1U << AUDIO_PADC_OEC_W1P_G2_LEN) - 1) << AUDIO_PADC_OEC_W1P_G2_POS))
#define AUDIO_PADC_OEC_W1P_G3      AUDIO_PADC_OEC_W1P_G3
#define AUDIO_PADC_OEC_W1P_G3_POS  (27U)
#define AUDIO_PADC_OEC_W1P_G3_LEN  (1U)
#define AUDIO_PADC_OEC_W1P_G3_MSK  (((1U << AUDIO_PADC_OEC_W1P_G3_LEN) - 1) << AUDIO_PADC_OEC_W1P_G3_POS)
#define AUDIO_PADC_OEC_W1P_G3_UMSK (~(((1U << AUDIO_PADC_OEC_W1P_G3_LEN) - 1) << AUDIO_PADC_OEC_W1P_G3_POS))
#define AUDIO_PADC_OEC_W1P_G4      AUDIO_PADC_OEC_W1P_G4
#define AUDIO_PADC_OEC_W1P_G4_POS  (28U)
#define AUDIO_PADC_OEC_W1P_G4_LEN  (1U)
#define AUDIO_PADC_OEC_W1P_G4_MSK  (((1U << AUDIO_PADC_OEC_W1P_G4_LEN) - 1) << AUDIO_PADC_OEC_W1P_G4_POS)
#define AUDIO_PADC_OEC_W1P_G4_UMSK (~(((1U << AUDIO_PADC_OEC_W1P_G4_LEN) - 1) << AUDIO_PADC_OEC_W1P_G4_POS))
#define AUDIO_PADC_OEC_W1P_G5      AUDIO_PADC_OEC_W1P_G5
#define AUDIO_PADC_OEC_W1P_G5_POS  (29U)
#define AUDIO_PADC_OEC_W1P_G5_LEN  (1U)
#define AUDIO_PADC_OEC_W1P_G5_MSK  (((1U << AUDIO_PADC_OEC_W1P_G5_LEN) - 1) << AUDIO_PADC_OEC_W1P_G5_POS)
#define AUDIO_PADC_OEC_W1P_G5_UMSK (~(((1U << AUDIO_PADC_OEC_W1P_G5_LEN) - 1) << AUDIO_PADC_OEC_W1P_G5_POS))
#define AUDIO_PADC_OEC_W1P_G6      AUDIO_PADC_OEC_W1P_G6
#define AUDIO_PADC_OEC_W1P_G6_POS  (30U)
#define AUDIO_PADC_OEC_W1P_G6_LEN  (1U)
#define AUDIO_PADC_OEC_W1P_G6_MSK  (((1U << AUDIO_PADC_OEC_W1P_G6_LEN) - 1) << AUDIO_PADC_OEC_W1P_G6_POS)
#define AUDIO_PADC_OEC_W1P_G6_UMSK (~(((1U << AUDIO_PADC_OEC_W1P_G6_LEN) - 1) << AUDIO_PADC_OEC_W1P_G6_POS))
#define AUDIO_PADC_OEC_W1P_G7      AUDIO_PADC_OEC_W1P_G7
#define AUDIO_PADC_OEC_W1P_G7_POS  (31U)
#define AUDIO_PADC_OEC_W1P_G7_LEN  (1U)
#define AUDIO_PADC_OEC_W1P_G7_MSK  (((1U << AUDIO_PADC_OEC_W1P_G7_LEN) - 1) << AUDIO_PADC_OEC_W1P_G7_POS)
#define AUDIO_PADC_OEC_W1P_G7_UMSK (~(((1U << AUDIO_PADC_OEC_W1P_G7_LEN) - 1) << AUDIO_PADC_OEC_W1P_G7_POS))

/* 0x83C : padc_gec_w1p */
#define AUDIO_PADC_GEC_W1P_OFFSET  (0x83C)
#define AUDIO_PADC_WR_GEC          AUDIO_PADC_WR_GEC
#define AUDIO_PADC_WR_GEC_POS      (0U)
#define AUDIO_PADC_WR_GEC_LEN      (24U)
#define AUDIO_PADC_WR_GEC_MSK      (((1U << AUDIO_PADC_WR_GEC_LEN) - 1) << AUDIO_PADC_WR_GEC_POS)
#define AUDIO_PADC_WR_GEC_UMSK     (~(((1U << AUDIO_PADC_WR_GEC_LEN) - 1) << AUDIO_PADC_WR_GEC_POS))
#define AUDIO_PADC_GEC_W1P_G0      AUDIO_PADC_GEC_W1P_G0
#define AUDIO_PADC_GEC_W1P_G0_POS  (24U)
#define AUDIO_PADC_GEC_W1P_G0_LEN  (1U)
#define AUDIO_PADC_GEC_W1P_G0_MSK  (((1U << AUDIO_PADC_GEC_W1P_G0_LEN) - 1) << AUDIO_PADC_GEC_W1P_G0_POS)
#define AUDIO_PADC_GEC_W1P_G0_UMSK (~(((1U << AUDIO_PADC_GEC_W1P_G0_LEN) - 1) << AUDIO_PADC_GEC_W1P_G0_POS))
#define AUDIO_PADC_GEC_W1P_G1      AUDIO_PADC_GEC_W1P_G1
#define AUDIO_PADC_GEC_W1P_G1_POS  (25U)
#define AUDIO_PADC_GEC_W1P_G1_LEN  (1U)
#define AUDIO_PADC_GEC_W1P_G1_MSK  (((1U << AUDIO_PADC_GEC_W1P_G1_LEN) - 1) << AUDIO_PADC_GEC_W1P_G1_POS)
#define AUDIO_PADC_GEC_W1P_G1_UMSK (~(((1U << AUDIO_PADC_GEC_W1P_G1_LEN) - 1) << AUDIO_PADC_GEC_W1P_G1_POS))
#define AUDIO_PADC_GEC_W1P_G2      AUDIO_PADC_GEC_W1P_G2
#define AUDIO_PADC_GEC_W1P_G2_POS  (26U)
#define AUDIO_PADC_GEC_W1P_G2_LEN  (1U)
#define AUDIO_PADC_GEC_W1P_G2_MSK  (((1U << AUDIO_PADC_GEC_W1P_G2_LEN) - 1) << AUDIO_PADC_GEC_W1P_G2_POS)
#define AUDIO_PADC_GEC_W1P_G2_UMSK (~(((1U << AUDIO_PADC_GEC_W1P_G2_LEN) - 1) << AUDIO_PADC_GEC_W1P_G2_POS))
#define AUDIO_PADC_GEC_W1P_G3      AUDIO_PADC_GEC_W1P_G3
#define AUDIO_PADC_GEC_W1P_G3_POS  (27U)
#define AUDIO_PADC_GEC_W1P_G3_LEN  (1U)
#define AUDIO_PADC_GEC_W1P_G3_MSK  (((1U << AUDIO_PADC_GEC_W1P_G3_LEN) - 1) << AUDIO_PADC_GEC_W1P_G3_POS)
#define AUDIO_PADC_GEC_W1P_G3_UMSK (~(((1U << AUDIO_PADC_GEC_W1P_G3_LEN) - 1) << AUDIO_PADC_GEC_W1P_G3_POS))
#define AUDIO_PADC_GEC_W1P_G4      AUDIO_PADC_GEC_W1P_G4
#define AUDIO_PADC_GEC_W1P_G4_POS  (28U)
#define AUDIO_PADC_GEC_W1P_G4_LEN  (1U)
#define AUDIO_PADC_GEC_W1P_G4_MSK  (((1U << AUDIO_PADC_GEC_W1P_G4_LEN) - 1) << AUDIO_PADC_GEC_W1P_G4_POS)
#define AUDIO_PADC_GEC_W1P_G4_UMSK (~(((1U << AUDIO_PADC_GEC_W1P_G4_LEN) - 1) << AUDIO_PADC_GEC_W1P_G4_POS))
#define AUDIO_PADC_GEC_W1P_G5      AUDIO_PADC_GEC_W1P_G5
#define AUDIO_PADC_GEC_W1P_G5_POS  (29U)
#define AUDIO_PADC_GEC_W1P_G5_LEN  (1U)
#define AUDIO_PADC_GEC_W1P_G5_MSK  (((1U << AUDIO_PADC_GEC_W1P_G5_LEN) - 1) << AUDIO_PADC_GEC_W1P_G5_POS)
#define AUDIO_PADC_GEC_W1P_G5_UMSK (~(((1U << AUDIO_PADC_GEC_W1P_G5_LEN) - 1) << AUDIO_PADC_GEC_W1P_G5_POS))
#define AUDIO_PADC_GEC_W1P_G6      AUDIO_PADC_GEC_W1P_G6
#define AUDIO_PADC_GEC_W1P_G6_POS  (30U)
#define AUDIO_PADC_GEC_W1P_G6_LEN  (1U)
#define AUDIO_PADC_GEC_W1P_G6_MSK  (((1U << AUDIO_PADC_GEC_W1P_G6_LEN) - 1) << AUDIO_PADC_GEC_W1P_G6_POS)
#define AUDIO_PADC_GEC_W1P_G6_UMSK (~(((1U << AUDIO_PADC_GEC_W1P_G6_LEN) - 1) << AUDIO_PADC_GEC_W1P_G6_POS))
#define AUDIO_PADC_GEC_W1P_G7      AUDIO_PADC_GEC_W1P_G7
#define AUDIO_PADC_GEC_W1P_G7_POS  (31U)
#define AUDIO_PADC_GEC_W1P_G7_LEN  (1U)
#define AUDIO_PADC_GEC_W1P_G7_MSK  (((1U << AUDIO_PADC_GEC_W1P_G7_LEN) - 1) << AUDIO_PADC_GEC_W1P_G7_POS)
#define AUDIO_PADC_GEC_W1P_G7_UMSK (~(((1U << AUDIO_PADC_GEC_W1P_G7_LEN) - 1) << AUDIO_PADC_GEC_W1P_G7_POS))

/* 0x840 : padc_oec_cfg0 */
#define AUDIO_PADC_OEC_CFG0_OFFSET (0x840)
#define AUDIO_PADC_OEC_G0          AUDIO_PADC_OEC_G0
#define AUDIO_PADC_OEC_G0_POS      (0U)
#define AUDIO_PADC_OEC_G0_LEN      (24U)
#define AUDIO_PADC_OEC_G0_MSK      (((1U << AUDIO_PADC_OEC_G0_LEN) - 1) << AUDIO_PADC_OEC_G0_POS)
#define AUDIO_PADC_OEC_G0_UMSK     (~(((1U << AUDIO_PADC_OEC_G0_LEN) - 1) << AUDIO_PADC_OEC_G0_POS))

/* 0x844 : padc_oec_cfg1 */
#define AUDIO_PADC_OEC_CFG1_OFFSET (0x844)
#define AUDIO_PADC_OEC_G1          AUDIO_PADC_OEC_G1
#define AUDIO_PADC_OEC_G1_POS      (0U)
#define AUDIO_PADC_OEC_G1_LEN      (24U)
#define AUDIO_PADC_OEC_G1_MSK      (((1U << AUDIO_PADC_OEC_G1_LEN) - 1) << AUDIO_PADC_OEC_G1_POS)
#define AUDIO_PADC_OEC_G1_UMSK     (~(((1U << AUDIO_PADC_OEC_G1_LEN) - 1) << AUDIO_PADC_OEC_G1_POS))

/* 0x848 : padc_oec_cfg2 */
#define AUDIO_PADC_OEC_CFG2_OFFSET (0x848)
#define AUDIO_PADC_OEC_G2          AUDIO_PADC_OEC_G2
#define AUDIO_PADC_OEC_G2_POS      (0U)
#define AUDIO_PADC_OEC_G2_LEN      (24U)
#define AUDIO_PADC_OEC_G2_MSK      (((1U << AUDIO_PADC_OEC_G2_LEN) - 1) << AUDIO_PADC_OEC_G2_POS)
#define AUDIO_PADC_OEC_G2_UMSK     (~(((1U << AUDIO_PADC_OEC_G2_LEN) - 1) << AUDIO_PADC_OEC_G2_POS))

/* 0x84C : padc_oec_cfg3 */
#define AUDIO_PADC_OEC_CFG3_OFFSET (0x84C)
#define AUDIO_PADC_OEC_G3          AUDIO_PADC_OEC_G3
#define AUDIO_PADC_OEC_G3_POS      (0U)
#define AUDIO_PADC_OEC_G3_LEN      (24U)
#define AUDIO_PADC_OEC_G3_MSK      (((1U << AUDIO_PADC_OEC_G3_LEN) - 1) << AUDIO_PADC_OEC_G3_POS)
#define AUDIO_PADC_OEC_G3_UMSK     (~(((1U << AUDIO_PADC_OEC_G3_LEN) - 1) << AUDIO_PADC_OEC_G3_POS))

/* 0x850 : padc_oec_cfg4 */
#define AUDIO_PADC_OEC_CFG4_OFFSET (0x850)
#define AUDIO_PADC_OEC_G4          AUDIO_PADC_OEC_G4
#define AUDIO_PADC_OEC_G4_POS      (0U)
#define AUDIO_PADC_OEC_G4_LEN      (24U)
#define AUDIO_PADC_OEC_G4_MSK      (((1U << AUDIO_PADC_OEC_G4_LEN) - 1) << AUDIO_PADC_OEC_G4_POS)
#define AUDIO_PADC_OEC_G4_UMSK     (~(((1U << AUDIO_PADC_OEC_G4_LEN) - 1) << AUDIO_PADC_OEC_G4_POS))

/* 0x854 : padc_oec_cfg5 */
#define AUDIO_PADC_OEC_CFG5_OFFSET (0x854)
#define AUDIO_PADC_OEC_G5          AUDIO_PADC_OEC_G5
#define AUDIO_PADC_OEC_G5_POS      (0U)
#define AUDIO_PADC_OEC_G5_LEN      (24U)
#define AUDIO_PADC_OEC_G5_MSK      (((1U << AUDIO_PADC_OEC_G5_LEN) - 1) << AUDIO_PADC_OEC_G5_POS)
#define AUDIO_PADC_OEC_G5_UMSK     (~(((1U << AUDIO_PADC_OEC_G5_LEN) - 1) << AUDIO_PADC_OEC_G5_POS))

/* 0x858 : padc_oec_cfg6 */
#define AUDIO_PADC_OEC_CFG6_OFFSET (0x858)
#define AUDIO_PADC_OEC_G6          AUDIO_PADC_OEC_G6
#define AUDIO_PADC_OEC_G6_POS      (0U)
#define AUDIO_PADC_OEC_G6_LEN      (24U)
#define AUDIO_PADC_OEC_G6_MSK      (((1U << AUDIO_PADC_OEC_G6_LEN) - 1) << AUDIO_PADC_OEC_G6_POS)
#define AUDIO_PADC_OEC_G6_UMSK     (~(((1U << AUDIO_PADC_OEC_G6_LEN) - 1) << AUDIO_PADC_OEC_G6_POS))

/* 0x85C : padc_oec_cfg7 */
#define AUDIO_PADC_OEC_CFG7_OFFSET (0x85C)
#define AUDIO_PADC_OEC_G7          AUDIO_PADC_OEC_G7
#define AUDIO_PADC_OEC_G7_POS      (0U)
#define AUDIO_PADC_OEC_G7_LEN      (24U)
#define AUDIO_PADC_OEC_G7_MSK      (((1U << AUDIO_PADC_OEC_G7_LEN) - 1) << AUDIO_PADC_OEC_G7_POS)
#define AUDIO_PADC_OEC_G7_UMSK     (~(((1U << AUDIO_PADC_OEC_G7_LEN) - 1) << AUDIO_PADC_OEC_G7_POS))

/* 0x860 : padc_gec_cfg0 */
#define AUDIO_PADC_GEC_CFG0_OFFSET (0x860)
#define AUDIO_PADC_GEC_G0          AUDIO_PADC_GEC_G0
#define AUDIO_PADC_GEC_G0_POS      (0U)
#define AUDIO_PADC_GEC_G0_LEN      (24U)
#define AUDIO_PADC_GEC_G0_MSK      (((1U << AUDIO_PADC_GEC_G0_LEN) - 1) << AUDIO_PADC_GEC_G0_POS)
#define AUDIO_PADC_GEC_G0_UMSK     (~(((1U << AUDIO_PADC_GEC_G0_LEN) - 1) << AUDIO_PADC_GEC_G0_POS))

/* 0x864 : padc_gec_cfg1 */
#define AUDIO_PADC_GEC_CFG1_OFFSET (0x864)
#define AUDIO_PADC_GEC_G1          AUDIO_PADC_GEC_G1
#define AUDIO_PADC_GEC_G1_POS      (0U)
#define AUDIO_PADC_GEC_G1_LEN      (24U)
#define AUDIO_PADC_GEC_G1_MSK      (((1U << AUDIO_PADC_GEC_G1_LEN) - 1) << AUDIO_PADC_GEC_G1_POS)
#define AUDIO_PADC_GEC_G1_UMSK     (~(((1U << AUDIO_PADC_GEC_G1_LEN) - 1) << AUDIO_PADC_GEC_G1_POS))

/* 0x868 : padc_gec_cfg2 */
#define AUDIO_PADC_GEC_CFG2_OFFSET (0x868)
#define AUDIO_PADC_GEC_G2          AUDIO_PADC_GEC_G2
#define AUDIO_PADC_GEC_G2_POS      (0U)
#define AUDIO_PADC_GEC_G2_LEN      (24U)
#define AUDIO_PADC_GEC_G2_MSK      (((1U << AUDIO_PADC_GEC_G2_LEN) - 1) << AUDIO_PADC_GEC_G2_POS)
#define AUDIO_PADC_GEC_G2_UMSK     (~(((1U << AUDIO_PADC_GEC_G2_LEN) - 1) << AUDIO_PADC_GEC_G2_POS))

/* 0x86C : padc_gec_cfg3 */
#define AUDIO_PADC_GEC_CFG3_OFFSET (0x86C)
#define AUDIO_PADC_GEC_G3          AUDIO_PADC_GEC_G3
#define AUDIO_PADC_GEC_G3_POS      (0U)
#define AUDIO_PADC_GEC_G3_LEN      (24U)
#define AUDIO_PADC_GEC_G3_MSK      (((1U << AUDIO_PADC_GEC_G3_LEN) - 1) << AUDIO_PADC_GEC_G3_POS)
#define AUDIO_PADC_GEC_G3_UMSK     (~(((1U << AUDIO_PADC_GEC_G3_LEN) - 1) << AUDIO_PADC_GEC_G3_POS))

/* 0x870 : padc_gec_cfg4 */
#define AUDIO_PADC_GEC_CFG4_OFFSET (0x870)
#define AUDIO_PADC_GEC_G4          AUDIO_PADC_GEC_G4
#define AUDIO_PADC_GEC_G4_POS      (0U)
#define AUDIO_PADC_GEC_G4_LEN      (24U)
#define AUDIO_PADC_GEC_G4_MSK      (((1U << AUDIO_PADC_GEC_G4_LEN) - 1) << AUDIO_PADC_GEC_G4_POS)
#define AUDIO_PADC_GEC_G4_UMSK     (~(((1U << AUDIO_PADC_GEC_G4_LEN) - 1) << AUDIO_PADC_GEC_G4_POS))

/* 0x874 : padc_gec_cfg5 */
#define AUDIO_PADC_GEC_CFG5_OFFSET (0x874)
#define AUDIO_PADC_GEC_G5          AUDIO_PADC_GEC_G5
#define AUDIO_PADC_GEC_G5_POS      (0U)
#define AUDIO_PADC_GEC_G5_LEN      (24U)
#define AUDIO_PADC_GEC_G5_MSK      (((1U << AUDIO_PADC_GEC_G5_LEN) - 1) << AUDIO_PADC_GEC_G5_POS)
#define AUDIO_PADC_GEC_G5_UMSK     (~(((1U << AUDIO_PADC_GEC_G5_LEN) - 1) << AUDIO_PADC_GEC_G5_POS))

/* 0x878 : padc_gec_cfg6 */
#define AUDIO_PADC_GEC_CFG6_OFFSET (0x878)
#define AUDIO_PADC_GEC_G6          AUDIO_PADC_GEC_G6
#define AUDIO_PADC_GEC_G6_POS      (0U)
#define AUDIO_PADC_GEC_G6_LEN      (24U)
#define AUDIO_PADC_GEC_G6_MSK      (((1U << AUDIO_PADC_GEC_G6_LEN) - 1) << AUDIO_PADC_GEC_G6_POS)
#define AUDIO_PADC_GEC_G6_UMSK     (~(((1U << AUDIO_PADC_GEC_G6_LEN) - 1) << AUDIO_PADC_GEC_G6_POS))

/* 0x87C : padc_gec_cfg7 */
#define AUDIO_PADC_GEC_CFG7_OFFSET (0x87C)
#define AUDIO_PADC_GEC_G7          AUDIO_PADC_GEC_G7
#define AUDIO_PADC_GEC_G7_POS      (0U)
#define AUDIO_PADC_GEC_G7_LEN      (24U)
#define AUDIO_PADC_GEC_G7_MSK      (((1U << AUDIO_PADC_GEC_G7_LEN) - 1) << AUDIO_PADC_GEC_G7_POS)
#define AUDIO_PADC_GEC_G7_UMSK     (~(((1U << AUDIO_PADC_GEC_G7_LEN) - 1) << AUDIO_PADC_GEC_G7_POS))

/* 0x900 : padc_rx_fifo_ctrl */
#define AUDIO_PADC_RX_FIFO_CTRL_OFFSET (0x900)
#define AUDIO_PADC_RX_FIFO_FLUSH       AUDIO_PADC_RX_FIFO_FLUSH
#define AUDIO_PADC_RX_FIFO_FLUSH_POS   (0U)
#define AUDIO_PADC_RX_FIFO_FLUSH_LEN   (1U)
#define AUDIO_PADC_RX_FIFO_FLUSH_MSK   (((1U << AUDIO_PADC_RX_FIFO_FLUSH_LEN) - 1) << AUDIO_PADC_RX_FIFO_FLUSH_POS)
#define AUDIO_PADC_RX_FIFO_FLUSH_UMSK  (~(((1U << AUDIO_PADC_RX_FIFO_FLUSH_LEN) - 1) << AUDIO_PADC_RX_FIFO_FLUSH_POS))
#define AUDIO_PADC_RXO_INT_EN          AUDIO_PADC_RXO_INT_EN
#define AUDIO_PADC_RXO_INT_EN_POS      (1U)
#define AUDIO_PADC_RXO_INT_EN_LEN      (1U)
#define AUDIO_PADC_RXO_INT_EN_MSK      (((1U << AUDIO_PADC_RXO_INT_EN_LEN) - 1) << AUDIO_PADC_RXO_INT_EN_POS)
#define AUDIO_PADC_RXO_INT_EN_UMSK     (~(((1U << AUDIO_PADC_RXO_INT_EN_LEN) - 1) << AUDIO_PADC_RXO_INT_EN_POS))
#define AUDIO_PADC_RXU_INT_EN          AUDIO_PADC_RXU_INT_EN
#define AUDIO_PADC_RXU_INT_EN_POS      (2U)
#define AUDIO_PADC_RXU_INT_EN_LEN      (1U)
#define AUDIO_PADC_RXU_INT_EN_MSK      (((1U << AUDIO_PADC_RXU_INT_EN_LEN) - 1) << AUDIO_PADC_RXU_INT_EN_POS)
#define AUDIO_PADC_RXU_INT_EN_UMSK     (~(((1U << AUDIO_PADC_RXU_INT_EN_LEN) - 1) << AUDIO_PADC_RXU_INT_EN_POS))
#define AUDIO_PADC_RXA_INT_EN          AUDIO_PADC_RXA_INT_EN
#define AUDIO_PADC_RXA_INT_EN_POS      (3U)
#define AUDIO_PADC_RXA_INT_EN_LEN      (1U)
#define AUDIO_PADC_RXA_INT_EN_MSK      (((1U << AUDIO_PADC_RXA_INT_EN_LEN) - 1) << AUDIO_PADC_RXA_INT_EN_POS)
#define AUDIO_PADC_RXA_INT_EN_UMSK     (~(((1U << AUDIO_PADC_RXA_INT_EN_LEN) - 1) << AUDIO_PADC_RXA_INT_EN_POS))
#define AUDIO_PADC_RX_DRQ_EN           AUDIO_PADC_RX_DRQ_EN
#define AUDIO_PADC_RX_DRQ_EN_POS       (4U)
#define AUDIO_PADC_RX_DRQ_EN_LEN       (1U)
#define AUDIO_PADC_RX_DRQ_EN_MSK       (((1U << AUDIO_PADC_RX_DRQ_EN_LEN) - 1) << AUDIO_PADC_RX_DRQ_EN_POS)
#define AUDIO_PADC_RX_DRQ_EN_UMSK      (~(((1U << AUDIO_PADC_RX_DRQ_EN_LEN) - 1) << AUDIO_PADC_RX_DRQ_EN_POS))
#define AUDIO_PADC_RX_DATA_RES         AUDIO_PADC_RX_DATA_RES
#define AUDIO_PADC_RX_DATA_RES_POS     (5U)
#define AUDIO_PADC_RX_DATA_RES_LEN     (1U)
#define AUDIO_PADC_RX_DATA_RES_MSK     (((1U << AUDIO_PADC_RX_DATA_RES_LEN) - 1) << AUDIO_PADC_RX_DATA_RES_POS)
#define AUDIO_PADC_RX_DATA_RES_UMSK    (~(((1U << AUDIO_PADC_RX_DATA_RES_LEN) - 1) << AUDIO_PADC_RX_DATA_RES_POS))
#define AUDIO_PADC_RX_CH_EN            AUDIO_PADC_RX_CH_EN
#define AUDIO_PADC_RX_CH_EN_POS        (8U)
#define AUDIO_PADC_RX_CH_EN_LEN        (1U)
#define AUDIO_PADC_RX_CH_EN_MSK        (((1U << AUDIO_PADC_RX_CH_EN_LEN) - 1) << AUDIO_PADC_RX_CH_EN_POS)
#define AUDIO_PADC_RX_CH_EN_UMSK       (~(((1U << AUDIO_PADC_RX_CH_EN_LEN) - 1) << AUDIO_PADC_RX_CH_EN_POS))
#define AUDIO_PADC_RX_DRQ_CNT          AUDIO_PADC_RX_DRQ_CNT
#define AUDIO_PADC_RX_DRQ_CNT_POS      (14U)
#define AUDIO_PADC_RX_DRQ_CNT_LEN      (2U)
#define AUDIO_PADC_RX_DRQ_CNT_MSK      (((1U << AUDIO_PADC_RX_DRQ_CNT_LEN) - 1) << AUDIO_PADC_RX_DRQ_CNT_POS)
#define AUDIO_PADC_RX_DRQ_CNT_UMSK     (~(((1U << AUDIO_PADC_RX_DRQ_CNT_LEN) - 1) << AUDIO_PADC_RX_DRQ_CNT_POS))
#define AUDIO_PADC_RX_TRG_LEVEL        AUDIO_PADC_RX_TRG_LEVEL
#define AUDIO_PADC_RX_TRG_LEVEL_POS    (16U)
#define AUDIO_PADC_RX_TRG_LEVEL_LEN    (4U)
#define AUDIO_PADC_RX_TRG_LEVEL_MSK    (((1U << AUDIO_PADC_RX_TRG_LEVEL_LEN) - 1) << AUDIO_PADC_RX_TRG_LEVEL_POS)
#define AUDIO_PADC_RX_TRG_LEVEL_UMSK   (~(((1U << AUDIO_PADC_RX_TRG_LEVEL_LEN) - 1) << AUDIO_PADC_RX_TRG_LEVEL_POS))
#define AUDIO_PADC_RX_DATA_MODE        AUDIO_PADC_RX_DATA_MODE
#define AUDIO_PADC_RX_DATA_MODE_POS    (24U)
#define AUDIO_PADC_RX_DATA_MODE_LEN    (2U)
#define AUDIO_PADC_RX_DATA_MODE_MSK    (((1U << AUDIO_PADC_RX_DATA_MODE_LEN) - 1) << AUDIO_PADC_RX_DATA_MODE_POS)
#define AUDIO_PADC_RX_DATA_MODE_UMSK   (~(((1U << AUDIO_PADC_RX_DATA_MODE_LEN) - 1) << AUDIO_PADC_RX_DATA_MODE_POS))

