bouffalolab/bouffalo_sdk/components/multimedia/xcodec/src/bl606p/drv/msp_audio_reg.h
    /* 0x204 : peq_00_b1 */
    union {
        struct {
            uint32_t peq_00_b1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_00_b1;

    /* 0x208 : peq_00_b2 */
    union {
        struct {
            uint32_t peq_00_b2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_00_b2;

    /* 0x20C : peq_00_a1 */
    union {
        struct {
            uint32_t peq_00_a1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_00_a1;

    /* 0x210 : peq_00_a2 */
    union {
        struct {
            uint32_t peq_00_a2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_00_a2;

    /* 0x214 : peq_01_b0 */
    union {
        struct {
            uint32_t peq_01_b0      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t peq_01_byp     : 1;  /* [   20],        r/w,        0x1 */
            uint32_t peq_01_qfmt    : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31 : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_01_b0;

    /* 0x218 : peq_01_b1 */
    union {
        struct {
            uint32_t peq_01_b1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_01_b1;

    /* 0x21C : peq_01_b2 */
    union {
        struct {
            uint32_t peq_01_b2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_01_b2;

    /* 0x220 : peq_01_a1 */
    union {
        struct {
            uint32_t peq_01_a1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_01_a1;

    /* 0x224 : peq_01_a2 */
    union {
        struct {
            uint32_t peq_01_a2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_01_a2;

    /* 0x228 : peq_02_b0 */
    union {
        struct {
            uint32_t peq_02_b0      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t peq_02_byp     : 1;  /* [   20],        r/w,        0x1 */
            uint32_t peq_02_qfmt    : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31 : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_02_b0;

    /* 0x22C : peq_02_b1 */
    union {
        struct {
            uint32_t peq_02_b1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_02_b1;

    /* 0x230 : peq_02_b2 */
    union {
        struct {
            uint32_t peq_02_b2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_02_b2;

    /* 0x234 : peq_02_a1 */
    union {
        struct {
            uint32_t peq_02_a1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_02_a1;

    /* 0x238 : peq_02_a2 */
    union {
        struct {
            uint32_t peq_02_a2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_02_a2;

    /* 0x23C : peq_03_b0 */
    union {
        struct {
            uint32_t peq_03_b0      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t peq_03_byp     : 1;  /* [   20],        r/w,        0x1 */
            uint32_t peq_03_qfmt    : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31 : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_03_b0;

    /* 0x240 : peq_03_b1 */
    union {
        struct {
            uint32_t peq_03_b1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_03_b1;

    /* 0x244 : peq_03_b2 */
    union {
        struct {
            uint32_t peq_03_b2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_03_b2;

    /* 0x248 : peq_03_a1 */
    union {
        struct {
            uint32_t peq_03_a1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_03_a1;

    /* 0x24C : peq_03_a2 */
    union {
        struct {
            uint32_t peq_03_a2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_03_a2;

    /* 0x250 : peq_04_b0 */
    union {
        struct {
            uint32_t peq_04_b0      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t peq_04_byp     : 1;  /* [   20],        r/w,        0x1 */
            uint32_t peq_04_qfmt    : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31 : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_04_b0;

    /* 0x254 : peq_04_b1 */
    union {
        struct {
            uint32_t peq_04_b1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_04_b1;

    /* 0x258 : peq_04_b2 */
    union {
        struct {
            uint32_t peq_04_b2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_04_b2;

    /* 0x25C : peq_04_a1 */
    union {
        struct {
            uint32_t peq_04_a1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_04_a1;

    /* 0x260 : peq_04_a2 */
    union {
        struct {
            uint32_t peq_04_a2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_04_a2;

    /* 0x264 : peq_05_b0 */
    union {
        struct {
            uint32_t peq_05_b0      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t peq_05_byp     : 1;  /* [   20],        r/w,        0x1 */
            uint32_t peq_05_qfmt    : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31 : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_05_b0;

    /* 0x268 : peq_05_b1 */
    union {
        struct {
            uint32_t peq_05_b1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_05_b1;

    /* 0x26C : peq_05_b2 */
    union {
        struct {
            uint32_t peq_05_b2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_05_b2;

    /* 0x270 : peq_05_a1 */
    union {
        struct {
            uint32_t peq_05_a1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_05_a1;

    /* 0x274 : peq_05_a2 */
    union {
        struct {
            uint32_t peq_05_a2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_05_a2;

