bouffalolab/bouffalo_sdk/components/multimedia/xcodec/src/bl606p/drv/msp_audio_reg.h
    /* 0x2C8 : peq_10_b0 */
    union {
        struct {
            uint32_t peq_10_b0      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t peq_10_byp     : 1;  /* [   20],        r/w,        0x1 */
            uint32_t peq_10_qfmt    : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31 : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_10_b0;

    /* 0x2CC : peq_10_b1 */
    union {
        struct {
            uint32_t peq_10_b1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_10_b1;

    /* 0x2D0 : peq_10_b2 */
    union {
        struct {
            uint32_t peq_10_b2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_10_b2;

    /* 0x2D4 : peq_10_a1 */
    union {
        struct {
            uint32_t peq_10_a1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_10_a1;

    /* 0x2D8 : peq_10_a2 */
    union {
        struct {
            uint32_t peq_10_a2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_10_a2;

    /* 0x2DC : peq_11_b0 */
    union {
        struct {
            uint32_t peq_11_b0      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t peq_11_byp     : 1;  /* [   20],        r/w,        0x1 */
            uint32_t peq_11_qfmt    : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31 : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_11_b0;

    /* 0x2E0 : peq_11_b1 */
    union {
        struct {
            uint32_t peq_11_b1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_11_b1;

    /* 0x2E4 : peq_11_b2 */
    union {
        struct {
            uint32_t peq_11_b2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_11_b2;

    /* 0x2E8 : peq_11_a1 */
    union {
        struct {
            uint32_t peq_11_a1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_11_a1;

    /* 0x2EC : peq_11_a2 */
    union {
        struct {
            uint32_t peq_11_a2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_11_a2;

    /* 0x2F0 : peq_12_b0 */
    union {
        struct {
            uint32_t peq_12_b0      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t peq_12_byp     : 1;  /* [   20],        r/w,        0x1 */
            uint32_t peq_12_qfmt    : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31 : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_12_b0;

    /* 0x2F4 : peq_12_b1 */
    union {
        struct {
            uint32_t peq_12_b1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_12_b1;

    /* 0x2F8 : peq_12_b2 */
    union {
        struct {
            uint32_t peq_12_b2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_12_b2;

    /* 0x2FC : peq_12_a1 */
    union {
        struct {
            uint32_t peq_12_a1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_12_a1;

    /* 0x300 : peq_12_a2 */
    union {
        struct {
            uint32_t peq_12_a2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_12_a2;

    /* 0x304 : peq_13_b0 */
    union {
        struct {
            uint32_t peq_13_b0      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t peq_13_byp     : 1;  /* [   20],        r/w,        0x1 */
            uint32_t peq_13_qfmt    : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31 : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_13_b0;

    /* 0x308 : peq_13_b1 */
    union {
        struct {
            uint32_t peq_13_b1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_13_b1;

    /* 0x30C : peq_13_b2 */
    union {
        struct {
            uint32_t peq_13_b2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_13_b2;

    /* 0x310 : peq_13_a1 */
    union {
        struct {
            uint32_t peq_13_a1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_13_a1;

    /* 0x314 : peq_13_a2 */
    union {
        struct {
            uint32_t peq_13_a2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_13_a2;

    /* 0x318 : peq_14_b0 */
    union {
        struct {
            uint32_t peq_14_b0      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t peq_14_byp     : 1;  /* [   20],        r/w,        0x1 */
            uint32_t peq_14_qfmt    : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31 : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_14_b0;

    /* 0x31C : peq_14_b1 */
    union {
        struct {
            uint32_t peq_14_b1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_14_b1;

    /* 0x320 : peq_14_b2 */
    union {
        struct {
            uint32_t peq_14_b2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_14_b2;

    /* 0x324 : peq_14_a1 */
    union {
        struct {
            uint32_t peq_14_a1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_14_a1;

    /* 0x328 : peq_14_a2 */
    union {
        struct {
            uint32_t peq_14_a2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_14_a2;

    /* 0x32C : peq_15_b0 */
    union {
        struct {
            uint32_t peq_15_b0      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t peq_15_byp     : 1;  /* [   20],        r/w,        0x1 */
            uint32_t peq_15_qfmt    : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31 : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_15_b0;

    /* 0x330 : peq_15_b1 */
    union {
        struct {
            uint32_t peq_15_b1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_15_b1;

    /* 0x334 : peq_15_b2 */
    union {
        struct {
            uint32_t peq_15_b2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_15_b2;

