bouffalolab/bouffalo_sdk/components/multimedia/xcodec/src/bl606p/drv/msp_audio_reg.h
    /* 0x338 : peq_15_a1 */
    union {
        struct {
            uint32_t peq_15_a1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_15_a1;

    /* 0x33C : peq_15_a2 */
    union {
        struct {
            uint32_t peq_15_a2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_15_a2;

    /* 0x340 : peq_16_b0 */
    union {
        struct {
            uint32_t peq_16_b0      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t peq_16_byp     : 1;  /* [   20],        r/w,        0x1 */
            uint32_t peq_16_qfmt    : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31 : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_16_b0;

    /* 0x344 : peq_16_b1 */
    union {
        struct {
            uint32_t peq_16_b1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_16_b1;

    /* 0x348 : peq_16_b2 */
    union {
        struct {
            uint32_t peq_16_b2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_16_b2;

    /* 0x34C : peq_16_a1 */
    union {
        struct {
            uint32_t peq_16_a1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_16_a1;

    /* 0x350 : peq_16_a2 */
    union {
        struct {
            uint32_t peq_16_a2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_16_a2;

    /* 0x354 : peq_17_b0 */
    union {
        struct {
            uint32_t peq_17_b0      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t peq_17_byp     : 1;  /* [   20],        r/w,        0x1 */
            uint32_t peq_17_qfmt    : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31 : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_17_b0;

    /* 0x358 : peq_17_b1 */
    union {
        struct {
            uint32_t peq_17_b1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_17_b1;

    /* 0x35C : peq_17_b2 */
    union {
        struct {
            uint32_t peq_17_b2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_17_b2;

    /* 0x360 : peq_17_a1 */
    union {
        struct {
            uint32_t peq_17_a1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_17_a1;

    /* 0x364 : peq_17_a2 */
    union {
        struct {
            uint32_t peq_17_a2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_17_a2;

    /* 0x368 : peq_18_b0 */
    union {
        struct {
            uint32_t peq_18_b0      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t peq_18_byp     : 1;  /* [   20],        r/w,        0x1 */
            uint32_t peq_18_qfmt    : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31 : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_18_b0;

    /* 0x36C : peq_18_b1 */
    union {
        struct {
            uint32_t peq_18_b1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_18_b1;

    /* 0x370 : peq_18_b2 */
    union {
        struct {
            uint32_t peq_18_b2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_18_b2;

    /* 0x374 : peq_18_a1 */
    union {
        struct {
            uint32_t peq_18_a1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_18_a1;

    /* 0x378 : peq_18_a2 */
    union {
        struct {
            uint32_t peq_18_a2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_18_a2;

    /* 0x37C : peq_19_b0 */
    union {
        struct {
            uint32_t peq_19_b0      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t peq_19_byp     : 1;  /* [   20],        r/w,        0x1 */
            uint32_t peq_19_qfmt    : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31 : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_19_b0;

    /* 0x380 : peq_19_b1 */
    union {
        struct {
            uint32_t peq_19_b1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_19_b1;

    /* 0x384 : peq_19_b2 */
    union {
        struct {
            uint32_t peq_19_b2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_19_b2;

    /* 0x388 : peq_19_a1 */
    union {
        struct {
            uint32_t peq_19_a1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_19_a1;

