bouffalolab/bouffalo_sdk/components/multimedia/xcodec/src/bl606p/drv/msp_audio_reg.h
    /* 0x38C : peq_19_a2 */
    union {
        struct {
            uint32_t peq_19_a2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_19_a2;

    /* 0x390 : peq_20_b0 */
    union {
        struct {
            uint32_t peq_20_b0      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t peq_20_byp     : 1;  /* [   20],        r/w,        0x1 */
            uint32_t peq_20_qfmt    : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_29 : 8;  /* [29:22],       rsvd,        0x0 */
            uint32_t adc_peq_in_sel : 2;  /* [31:30],        r/w,        0x3 */
        } BF;
        uint32_t WORD;
    } peq_20_b0;

    /* 0x394 : peq_20_b1 */
    union {
        struct {
            uint32_t peq_20_b1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_20_b1;

    /* 0x398 : peq_20_b2 */
    union {
        struct {
            uint32_t peq_20_b2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_20_b2;

    /* 0x39C : peq_20_a1 */
    union {
        struct {
            uint32_t peq_20_a1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_20_a1;

    /* 0x3A0 : peq_20_a2 */
    union {
        struct {
            uint32_t peq_20_a2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_20_a2;

    /* 0x3A4 : peq_21_b0 */
    union {
        struct {
            uint32_t peq_21_b0      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t peq_21_byp     : 1;  /* [   20],        r/w,        0x1 */
            uint32_t peq_21_qfmt    : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31 : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_21_b0;

    /* 0x3A8 : peq_21_b1 */
    union {
        struct {
            uint32_t peq_21_b1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_21_b1;

    /* 0x3AC : peq_21_b2 */
    union {
        struct {
            uint32_t peq_21_b2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_21_b2;

    /* 0x3B0 : peq_21_a1 */
    union {
        struct {
            uint32_t peq_21_a1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_21_a1;

    /* 0x3B4 : peq_21_a2 */
    union {
        struct {
            uint32_t peq_21_a2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_21_a2;

    /* 0x3B8 : peq_22_b0 */
    union {
        struct {
            uint32_t peq_22_b0      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t peq_22_byp     : 1;  /* [   20],        r/w,        0x1 */
            uint32_t peq_22_qfmt    : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31 : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_22_b0;

    /* 0x3BC : peq_22_b1 */
    union {
        struct {
            uint32_t peq_22_b1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_22_b1;

    /* 0x3C0 : peq_22_b2 */
    union {
        struct {
            uint32_t peq_22_b2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_22_b2;

    /* 0x3C4 : peq_22_a1 */
    union {
        struct {
            uint32_t peq_22_a1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_22_a1;

    /* 0x3C8 : peq_22_a2 */
    union {
        struct {
            uint32_t peq_22_a2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_22_a2;

    /* 0x3CC : peq_23_b0 */
    union {
        struct {
            uint32_t peq_23_b0      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t peq_23_byp     : 1;  /* [   20],        r/w,        0x1 */
            uint32_t peq_23_qfmt    : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31 : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_23_b0;

    /* 0x3D0 : peq_23_b1 */
    union {
        struct {
            uint32_t peq_23_b1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_23_b1;

    /* 0x3D4 : peq_23_b2 */
    union {
        struct {
            uint32_t peq_23_b2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_23_b2;

    /* 0x3D8 : peq_23_a1 */
    union {
        struct {
            uint32_t peq_23_a1      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_23_a1;

    /* 0x3DC : peq_23_a2 */
    union {
        struct {
            uint32_t peq_23_a2      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_23_a2;

    /* 0x3E0 : peq_24_b0 */
    union {
        struct {
            uint32_t peq_24_b0      : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t peq_24_byp     : 1;  /* [   20],        r/w,        0x1 */
            uint32_t peq_24_qfmt    : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31 : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } peq_24_b0;

