bouffalolab/bouffalo_sdk/components/multimedia/xcodec/src/bl606p/drv/msp_audio_reg.h
    /* 0x44C : dac_ngt_0 */
    union {
        struct {
            uint32_t reserved_0_1           : 2; /* [ 1: 0],       rsvd,        0x0 */
            uint32_t ngt_amute_on           : 1; /* [    2],        r/w,        0x0 */
            uint32_t ngt_dmute_on           : 1; /* [    3],        r/w,        0x0 */
            uint32_t ngt_signal_hold_time_k : 4; /* [ 7: 4],        r/w,        0x2 */
            uint32_t ngt_signal_hold_en     : 1; /* [    8],        r/w,        0x1 */
            uint32_t ngt_noise_hold_time_k  : 4; /* [12: 9],        r/w,        0x8 */
            uint32_t ngt_noise_hold_en      : 1; /* [   13],        r/w,        0x1 */
            uint32_t ngt_hysteresis         : 2; /* [15:14],        r/w,        0x2 */
            uint32_t ngt_threshold          : 8; /* [23:16],        r/w,       0xb5 */
            uint32_t ngt_avg_time           : 5; /* [28:24],        r/w,        0x2 */
            uint32_t ngt_src_sel            : 2; /* [30:29],        r/w,        0x3 */
            uint32_t ngt_en                 : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } dac_ngt_0;

    /* 0x450 : dac_zd_0 */
    union {
        struct {
            uint32_t zd_time          : 15; /* [14: 0],        r/w,      0x200 */
            uint32_t reserved_15      : 1;  /* [   15],       rsvd,        0x0 */
            uint32_t zd_en            : 2;  /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_29   : 12; /* [29:18],       rsvd,        0x0 */
            uint32_t dac_mute_hw_ctrl : 1;  /* [   30],        r/w,        0x1 */
            uint32_t dac_mute         : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } dac_zd_0;

    /* 0x454  reserved */
    uint8_t RESERVED0x454[428];

    /* 0x600 : vad_ctrl_0 */
    union {
        struct {
            uint32_t vad_nth_minlmt_en   : 1; /* [    0],        r/w,        0x1 */
            uint32_t vad_nth_maxlmt_en   : 1; /* [    1],        r/w,        0x1 */
            uint32_t vad_nbuf_monit_en   : 1; /* [    2],        r/w,        0x1 */
            uint32_t reserved_3          : 1; /* [    3],       rsvd,        0x0 */
            uint32_t vad_nbuf_monit_ctrl : 2; /* [ 5: 4],        r/w,        0x1 */
            uint32_t reserved_6_7        : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t vad_nbuf_len_ctrl   : 3; /* [10: 8],        r/w,        0x2 */
            uint32_t reserved_11         : 1; /* [   11],       rsvd,        0x0 */
            uint32_t vad_out_sel         : 2; /* [13:12],        r/w,        0x1 */
            uint32_t vad_frametime_ctrl  : 2; /* [15:14],        r/w,        0x1 */
            uint32_t vad_frameshift_ctrl : 3; /* [18:16],        r/w,        0x0 */
            uint32_t vad_out             : 1; /* [   19],          r,        0x0 */
            uint32_t vad_in_sel          : 3; /* [22:20],        r/w,        0x0 */
            uint32_t vad_en              : 1; /* [   23],        r/w,        0x0 */
            uint32_t reserved_24_31      : 8; /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } vad_ctrl_0;

    /* 0x604 : vad_ctrl_1 */
    union {
        struct {
            uint32_t vad_nth_scale    : 8;  /* [ 7: 0],        r/w,       0x33 */
            uint32_t vad_nth_bias     : 16; /* [23: 8],        r/w,       0x33 */
            uint32_t vad_nbuf_discard : 8;  /* [31:24],        r/w,       0x10 */
        } BF;
        uint32_t WORD;
    } vad_ctrl_1;

    /* 0x608 : vad_ctrl_2 */
    union {
        struct {
            uint32_t vad_nth_minlmt : 16; /* [15: 0],        r/w,       0x66 */
            uint32_t vad_nth_maxlmt : 16; /* [31:16],        r/w,     0x1400 */
        } BF;
        uint32_t WORD;
    } vad_ctrl_2;

    /* 0x60C : vad_ctrl_3 */
    union {
        struct {
            uint32_t vad_smooth_fall : 8;  /* [ 7: 0],        r/w,       0x80 */
            uint32_t vad_smooth_rise : 8;  /* [15: 8],        r/w,       0x10 */
            uint32_t reserved_16_31  : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } vad_ctrl_3;

    /* 0x610 : vad_ctrl_4 */
    union {
        struct {
            uint32_t vad_ek         : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } vad_ctrl_4;

    /* 0x614 : vad_ctrl_5 */
    union {
        struct {
            uint32_t vad_noise_th   : 24; /* [23: 0],          r,     0x6600 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } vad_ctrl_5;

    /* 0x618  reserved */
    uint8_t RESERVED0x618[232];

    /* 0x700 : codec_power1 */
    union {
        struct {
            uint32_t micbias_pu           : 1;  /* [    0],        r/w,        0x0 */
            uint32_t micbias_chop_en      : 1;  /* [    1],        r/w,        0x0 */
            uint32_t micbias_clk_chop_sel : 2;  /* [ 3: 2],        r/w,        0x2 */
            uint32_t micbias_vsel         : 2;  /* [ 5: 4],        r/w,        0x2 */
            uint32_t padc_ibias_source    : 1;  /* [    6],        r/w,        0x0 */
            uint32_t padc_power_ten       : 1;  /* [    7],        r/w,        0x0 */
            uint32_t padc_power_tmux      : 3;  /* [10: 8],        r/w,        0x0 */
            uint32_t reserved_11          : 1;  /* [   11],       rsvd,        0x0 */
            uint32_t codec_vrda_en        : 1;  /* [   12],        r/w,        0x0 */
            uint32_t codec_ictrl_vcm      : 2;  /* [14:13],        r/w,        0x2 */
            uint32_t reserved_15          : 1;  /* [   15],       rsvd,        0x0 */
            uint32_t codec_ibias_ctrl     : 3;  /* [18:16],        r/w,        0x4 */
            uint32_t reserved_19_31       : 13; /* [31:19],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } codec_power1;

    /* 0x704 : codec_power2 */
    union {
        struct {
            uint32_t hpbg_chop_sel      : 3; /* [ 2: 0],        r/w,        0x0 */
            uint32_t hpbg_chop_en       : 1; /* [    3],        r/w,        0x0 */
            uint32_t hpbg_pu            : 1; /* [    4],        r/w,        0x1 */
            uint32_t hpbg_filt_rsel     : 2; /* [ 6: 5],        r/w,        0x1 */
            uint32_t hpbg_bypass        : 1; /* [    7],        r/w,        0x0 */
            uint32_t hpbg_adjust_fine   : 4; /* [11: 8],        r/w,        0x1 */
            uint32_t hpbg_adjust_coarse : 4; /* [15:12],        r/w,        0x1 */
            uint32_t hpbg_compst_en     : 1; /* [   16],        r/w,        0x1 */
            uint32_t ldo25_sstart_en    : 1; /* [   17],        r/w,        0x1 */
            uint32_t ldo25_sstart_delay : 2; /* [19:18],        r/w,        0x1 */
            uint32_t ldo25_pulldown_sel : 1; /* [   20],        r/w,        0x0 */
            uint32_t ldo25_pulldown     : 1; /* [   21],        r/w,        0x0 */
            uint32_t ldo25_pu           : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23        : 1; /* [   23],       rsvd,        0x0 */
            uint32_t ldo25_chop_sel     : 3; /* [26:24],        r/w,        0x1 */
            uint32_t ldo25_chop_en      : 1; /* [   27],        r/w,        0x0 */
            uint32_t ldo25_cc_sel       : 3; /* [30:28],        r/w,        0x0 */
            uint32_t reserved_31        : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } codec_power2;

    /* 0x708 : codec_dac */
    union {
        struct {
            uint32_t dacr_lineout_gain            : 3; /* [ 2: 0],        r/w,        0x0 */
            uint32_t dacr_en_lineout              : 1; /* [    3],        r/w,        0x0 */
            uint32_t dacr_en_dac                  : 1; /* [    4],        r/w,        0x0 */
            uint32_t reserved_5                   : 1; /* [    5],       rsvd,        0x0 */
            uint32_t dacr_lineout_mode            : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7                   : 1; /* [    7],       rsvd,        0x0 */
            uint32_t dacr_ictrl_lineout           : 2; /* [ 9: 8],        r/w,        0x2 */
            uint32_t dacr_sdac_lineout            : 1; /* [   10],        r/w,        0x0 */
            uint32_t dacr_sdebug_lineout          : 1; /* [   11],        r/w,        0x0 */
            uint32_t dacr_ictrl_dac               : 2; /* [13:12],        r/w,        0x1 */
            uint32_t dacr_ckb_en                  : 1; /* [   14],        r/w,        0x0 */
            uint32_t reserved_15                  : 1; /* [   15],       rsvd,        0x0 */
            uint32_t dacl_lineout_gain            : 3; /* [18:16],        r/w,        0x0 */
            uint32_t dacl_en_lineout              : 1; /* [   19],        r/w,        0x0 */
            uint32_t dacl_en_dac                  : 1; /* [   20],        r/w,        0x0 */
            uint32_t reserved_21                  : 1; /* [   21],       rsvd,        0x0 */
            uint32_t dacl_lineout_mode            : 1; /* [   22],        r/w,        0x0 */
            uint32_t reserved_23                  : 1; /* [   23],       rsvd,        0x0 */
            uint32_t dacl_ictrl_lineout           : 2; /* [25:24],        r/w,        0x2 */
            uint32_t dacl_sdac_lineout            : 1; /* [   26],        r/w,        0x0 */
            uint32_t dacl_sdebug_lineout          : 1; /* [   27],        r/w,        0x0 */
            uint32_t dacl_ictrl_dac               : 2; /* [29:28],        r/w,        0x1 */
            uint32_t dacl_ckb_en                  : 1; /* [   30],        r/w,        0x0 */
            uint32_t dac_rg_lo_vref_ramp_dcl_busy : 1; /* [   31],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } codec_dac;

    /* 0x70C : codec_dac_ramp */
    union {
        struct {
            uint32_t dac_rg_lo_vref_ramp_dcl_en : 1;  /* [    0],        r/w,        0x0 */
            uint32_t dac_rg_lineout_vo_pulldown : 1;  /* [    1],        r/w,        0x0 */
            uint32_t dac_rg_pu_vref_ramp        : 1;  /* [    2],        r/w,        0x0 */
            uint32_t dac_rg_pu_lineout          : 1;  /* [    3],        r/w,        0x0 */
            uint32_t dac_rg_vref_ramp_step_t    : 3;  /* [ 6: 4],        r/w,        0x0 */
            uint32_t dac_rg_sw_vref             : 1;  /* [    7],        r/w,        0x0 */
            uint32_t dac_rg_vref_ramp_delay     : 2;  /* [ 9: 8],        r/w,        0x1 */
            uint32_t dac_rg_lo_vref_ramp_dvld   : 1;  /* [   10],          r,        0x0 */
            uint32_t dac_automute_en            : 1;  /* [   11],        r/w,        0x0 */
            uint32_t dg_dac_mute                : 1;  /* [   12],          r,        0x0 */
            uint32_t dg_vo_pulldown             : 1;  /* [   13],          r,        0x0 */
            uint32_t dg_pu_vref_ramp            : 1;  /* [   14],          r,        0x0 */
            uint32_t dg_vref_ramp_step          : 12; /* [26:15],          r,        0x0 */
            uint32_t dg_sw_vref                 : 1;  /* [   27],          r,        0x0 */
            uint32_t dg_dacr_en_lineout         : 1;  /* [   28],          r,        0x0 */
            uint32_t dg_dacl_en_lineout         : 1;  /* [   29],          r,        0x0 */
            uint32_t dac_rg_vref_ramp_dcl_mode  : 2;  /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } codec_dac_ramp;

